import styles from "@/app/article/page.module.css"
import Image from "next/image"
import OrderedContent from "./OrderedContent";
import ArticleDivider from "./ArticleDivider";
const AerticleServiceFive = () => {
    return (
        <div className={styles.articleRegister}>
            <span className={styles.mainTitle}>كيفية تسجيل العلامات التجارية في مصر؟</span>
            <Image src="/assets/images/article/image3.svg" alt="image" className={styles.regImg} width={860} height={400} />
            <OrderedContent
                desc={"ن توكيل محامي علامات تجارية هي أولوية قصوى لكل راغب في إتمام كافة العمليات القانونية المطلوبة، كما يجب على المتقدمين لتسجيل العلامة التجارية في مصر الالتزام بالإجراءات اللازمة وتقديم جميع الوثائق المطلوبة، والتأكد من عدم تعارض العلامة التجارية المراد تسجيلها مع العلامات التجارية المسجلة سابقََا، لضمان الحصول على حماية قانونية كاملة لحقوق الملكية الفكرية للعلامة التجارية في مصر. إليك كيفية تسجيل علامة تجارية في مصر من خلال:"}
                items={[
                    {
                        desc: `
تقديم طلب تسجيل العلامة التجارية إلى وزارة التموين والتجارة الداخلية. ويجب أن تكون المعلومات دقيقة وشاملة عن العلامة التجارية التي يرغب المتقدم في تسجيلها، بما في ذلك اسم العلامة ورمزها ووصف للسلع أو الخدمات التي سيتم استخدام العلامة فيها.`
                    },
                    {
                        desc: "تقديم معلومات عن مالك العلامة التجارية، بما في ذلك اسمه وعنوانه ومعلومات الاتصال به."
                    },
                    {
                        desc: `

يتم إتخاذ الإجراءات اللازمة للتحقق من الأهلية للتسجيل، والتأكد من عدم تشابه العلامة التجارية المراد تسجيلها مع العلامات التجارية المسجَّلة سابقََا.`
                    },
                    {
                        desc: "يتم تحديد رسوم التسجيل وفقََا للقوانين المصرية المعمول بها."
                    },
                    {
                        desc: "يتم تقديم طلب تسجيل العلامة إلى جهاز التنمية الداخلية بأحد مكاتب وزارة التجارة والصناعة في القاهرة."
                    },
                    {
                        desc: `
يمكن أيضََا تقديم الطلب في أي من المكاتب الإقليمية المنتشرة في جميع أنحاء البلاد، بشرط أن يحتوي الطلب على جميع المعلومات المطلوبة بشكل دقيق ومنظَّم.`
                    },
                    {
                        desc: `
يمكن تقديم طلب التسجيل عن طريق محامي مصري، للأفراد والشركات الأجنبية التي ليس لديها ممثل قانوني في مصر.`
                    }
                ]}
            />
                    <ArticleDivider/>

            <span className={styles.mainTitle}>متطلبات تسجيل علامة تجارية في مصر</span>
            <OrderedContent
                desc={"يجب أولاً على كل مَن يتساءل عن كيفية تسجيل علامة تجارية في مصر أو متقدِّم على طلب التسجيل، التعرف على متطلبات إتمام عملية التسجيل تطبيقًا للوائح القانونية المعمول بها في البلد المقصود. إليك متطلبات تسجيل العلامة التجارية في مصر:"}
                desc2={`
هذه هي الأوراق الأساسية المطلوبة لتسجيل العلامات التجارية في مصر، ويمكن أن يتطلب الموضوع متطلبات إضافية حسب الحالة الخاصة بكل شركة أو مؤسسة. وبعد التأكد من كافة المستندات المطلوبة يتم فحص العلامة التجارية المقَدَّمَة للتسجيل للتأكد من عدم تشابهها مع أي علامة تجارية أخرى. وفي حال وجود أي تشابه يتم رفض طلب التسجيل.`}
                items={[
                    {
                        desc: "أول إجراء فعلي مطلوب هو طلب تسجيل تصميم أو نموذج صناعي والغرض منه منع الغير من سرقة تصميم أو نموذج العلامة التجارية الخاص بك المحمي لأي أغراض تجارية."
                    },
                    {
                        desc: "عدد 4 صور لنموذج التصميم الخاص بعلامتك التجارية للتسجيل والحفط والحماية للملكية الفكرية."
                    },
                    {
                        desc: "بعدها من المهم تقديم مستخرج من عقد تأسيس الشركة أو العمل التجاري والنظام القانوني الخاص بها."
                    },
                    {
                        desc: "نسخة من شهادة الأصالة والجودة الصادرة عن الجهة المانحة للعلامة التجارية في مصر."
                    },
                    {
                        desc: "نسخة من الوثيقة الرسمية التي تثبت توكيل الممثل القانوني الذي سيتولى تقديم طلب التسجيل."
                    },
                    {
                        desc: "نسخة من بطاقة الرقم القومي للممثل القانوني."
                    },
                    {
                        desc: "استمارة التسجيل المعبأة بالكامل وموقعة من الممثل القانوني."
                    },
                    {
                        desc: "صورة للعلامة التجارية المطلوب تسجيلها."
                    },
                    {
                        desc: "دفع الرسوم المطلوبة لإجراء التسجيل."
                    },

                ]}
            />
            <span className={styles.mainTitle}>ما هي تكلفة تسجيل علامة تجارية في مصر؟</span>
            <OrderedContent
                desc={"تختلف تكلفة تسجيل علامة تجارية في مصر وفقََا لعدد الفئات التي يرغب المتقدِّم في تسجيلها. كما تختلف رسوم تسجيل العلامات في مصر وفقًا لنوع العلامة التجارية وعدد الفئات التي ستتم تغطيتها بالتسجيل. وتشمل هذه التكاليف:"}
                items={[
                    {
                        title: "رسوم التسجيل: ",
                        desc: "يجب دفع 1500 جنيه مصري لتسجيل علامة تجارية واحدة في مصر للفئة الأولى، وهذا يشمل رسوم التسجيل والتصريح الأولي."
                    },
                    {
                        title: "رسوم الفئات الإضافية: ",
                        desc: " تزيد الرسوم بناءً على عدد الفئات الإضافية التي يتم تسجيل العلامة التجارية لها. فعلى سبيل المثال، يتم تطبيق رسوم إضافية بتكلفة 1000 جنيه مصري لكل فئة إضافية تتم تغطيتها بالتسجيل."
                    },
                    {
                        title: "رسوم التجديد: ",
                        desc: "تبلغ رسوم تجديد العلامة التجارية 1500 جنيه مصري للفئة الأولى، بالإضافة إلى رسوم إضافية بقيمة 1000 جنيه مصري لكل فئة إضافية."
                    },
                    {
                        title: "رسوم المعارض والاعتراضات: ",
                        desc: " تزيد الرسوم أيضًا في حالة التعرض لأي معارض أو اعتراضات على العلامة التجارية. إذا تم رفض التسجيل، فسيتم استرداد جزء من الرسوم المدفوعة، ولكن ليس الكل."
                    }
                ]}
                head={"تنبيه هام: "}
                desc2={"يرجى العلم أن تلك الرسوم غير ثابته وقد تخضع للتغيير بين الحين والأخر؛ لذا يجب متابعة مستشارك القانوني لمعرفة أحدث المعلومات. كما يلزم التنبيه أن هذه الرسوم لا تشتمل أتعاب محامي العلامات التجارية الذي سيتولى كافة الإجراءات القانونية اللازمة."}
            />
            <span className={styles.mainTitle}>كم من الوقت يستغرق تسجيل علامة تجارية؟</span>
            <p>بالإضافة إلى اختلاف تكاليف تسجيل العلامات التجارية في مصر، كذلك تختلف المدة الزمنية المطلوبة لإتمام عملية التسجيل بناءً على عدد الفئات وعدد التعديلات اللازمة في طلب التسجيل, وعادةََ ما تستغرق العملية من 8 إلى 10 أشهر للانتهاء.</p>
            <span className={styles.mainTitle}>خطوات تسجيل العلامة التجارية بالسعودية</span>
            <OrderedContent
                items={[
                    {
                        desc: "التقديم للحصول على موافقة مسبقة: يتم تقديم طلب للحصول على موافقة مسبقة لتسجيل العلامة التجارية من خلال الهيئة السعودية للملكية الفكرية (SAIP). يجب تقديم المعلومات الأساسية للعلامة التجارية، بما في ذلك اسم المالك ونوع السلع أو الخدمات التي ستُستخدم العلامة التجارية لتسويقها."
                    },
                    {
                        title: "تقديم الطلب النهائي: ",
                        desc: "بعد الحصول على موافقة مسبقة، يتم تقديم الطلب النهائي لتسجيل العلامة التجارية لدى SAIP. يتضمن الطلب تفاصيل العلامة التجارية والسلع أو الخدمات المرتبطة بها."
                    },
                    {
                        title: "",
                        desc: "دراسة الطلب: يقوم SAIP والتأكد من استيفاء جميع الشروط والمتطلبات اللازمة لتسجيل العلامات التجارية فى السعودية. يتضمن ذلك التحقق من عدم وجود علامات تجارية مشابهة أو متشابهة بشكل كبير في سجلاتها."
                    },
                    {
                        title: "الإعلان عن العلامة التجارية: ",
                        desc: "بعد دراسة الطلب، يتم نشر إعلان عن العلامة التجارية المراد تسجيلها في الصحف الرسمية لمدة 90 يومًا. يسمح هذا الإعلان لأي شخص يعترض على تسجيل العلامة التجارية بتقديم اعتراض في خلال هذه المدة."
                    },
                    {
                        title: "الحصول على التسجيل: ",
                        desc: " إذا لم يتم تقديم أي اعتراضات خلال المدة المحددة، يتم إصدار شهادة التسجيل بالسعودية. يتم تسليم هذه الشهادة إلى المالك الحالي للعلامة التجارية."
                    }
                ]}
            />
        </div>
    )
}

export default AerticleServiceFive;