import Image from "next/image";
import OrderedContent from "./OrderedContent";
import styles from "@/app/article/page.module.css";

const ArticleServiceTwo = () => {
    const items = [
        { title: "حماية حقوق الملكية الفكرية:", desc: "حيث يتمكن مالك العلامة التجارية من حماية حقوق امتلاكه للعلامة، ومنع الآخرين من استخدامها دون إذنه." },
        { title: "تمييز المنتجات والخدمات:", desc: "حيث يمكن لعملية تسجيل العلامة التي تتم عبر محامي متخصص بالعلامات التجارية؛ أن تساعد على تمييز المنتجات والخدمات التي يقدمها مالكها، وتجعلها مميزة ومعروفة لدى الزبائن، ويسهل تذكرها والوصول إليها. كما تمنع الخلط بين المنتجات أو الخدمات المشابهة التي يقدمها المنافسون." },
        { title: "بناء الثقة والمصداقية:", desc: "حيث يساعد تسجيل العلامة التجارية على بناء الثقة والمصداقية لدى الزبائن؛ مما يخلق لديهم شعورٌ بالأمان عند شراء المنتجات أو الخدمات التي تحمل العلامة التجارية المسجَّلة والمعروفة." },
        { title: "الحماية القانونية:", desc: "حيث يضمن القانون حماية لمالك العلامة التجارية في حالة وجود انتهاكات لحقوقه بواسطة دعم محامي علامات تجارية متخصص، ويمكن حينها أن يتم رفع القضايا وفقًا للقوانين المتعلقة بحماية الملكية الفكرية، والتأكد من عدم التعرض للخسائر المالية والقانونية." },
        { title: "قيمة تسويقية عالية:", desc: "حيث يمكن للشركات استخدام العلامة التجارية للترويج والإعلان عن منتجاتها وخدماتها، ويمكن أن تساعد على بناء العلامة التجارية وتعزيز سمعتها وزيادة قيمتها التجارية في أسواق التبادل." },
        { title: "تسهيل عملية التسويق:", desc: "يتم ذلك من خلال الترويج والتسويق للمنتج أو الخدمة عبر الوسائل المختلفة، من الإنترنت، المواقع الإلكترونية، وسائل التواصل الاجتماعي أو الإعلانات؛ بهدف التواجد في الأسواق الدولية." }
    ];

    return (
        <div className={styles.brandImportant}>
            <span className={styles.headTitle}>أهمية تسجيل العلامة التجارية</span>
            <p>يهدف تسجيل العلامة التجارية بشكل عام إلى حماية حقوق الملكية الفكرية لصاحبها وتمييز منتجاته أو خدماته عن أقرانه من مقدمي الخدمة. كما يساعد على بناء الثقة والمصداقية والقيمة التسويقية للعلامة التجارية. ويمكن تلخيص فوائد العلامة التجارية فيما يلي:</p>
            <OrderedContent items={items} />
            <Image src="/assets/images/article/image2.svg" width={860} height={400} alt="Image 2" />

        </div>
    );
}

export default ArticleServiceTwo;


