import styles from "@/app/article/page.module.css";
import { BulletContent } from "./BulletContent";

const ArticleServiceThree = () => {
    return (
        <>
            <div>
                <span className={styles.mainTitle}>ما الفرق بين تسجيل العلامة التجارية بالنسبة للفرد أو الشركة؟</span>
                <p>يعرف المحامي المتخصص بالعلامات التجارية أوجه الاختلاف ما بين تسجيل العلامة التجارية للفرد أو الشركة، وما يتضمنه ذلك من تباينات في الحماية القانونية والحقوق المتعلقة بها. حيث يعد تسجيل العلامة التجارية من أهم الإجراءات التي يجب اتخاذها بعد تأسيس الشركة، حيث أنه يوفر حماية شاملة للعلامة وحقوق الملكية الفكرية التابعة لها، بينما يتم تسجيل العلامة للفرد لحمايتها في نطاق محدد وعلى نطاق النشاطات المهنية التي يمارسها الشخص.</p>
            </div>
            <div>
                <BulletContent
                    title={"الحماية القانونية"}
                    items={[
                        {
                            title: "بالنسبة للشركة ",
                            desc: "عندما يقوم محامي العلامات التجارية بتسجيل العلامة لصالح شركة، فإن الحماية القانونية تتعلق بالشركة نفسها كشخص معنوي، حيث يقوم محامي الشركات بتقديم الاستشارات اللازمة للشركة حول كيفية إدارة وحماية العلامة التجارية، وذلك بتحديد الحقوق المتعلقة بها ومراقبة استخدام العلامة التجارية من قبل الآخرين والكشف عن أي انتهاكات محتملة للحقوق المتعلقة بها، ويتم الحفاظ على هذه الحقوق حتى في حالة تغيير ملكية الشركة."
                        },
                        {
                            title: "بالنسبة للفرد",
                            desc: `
الحماية القانونية تتعلق بالفرد نفسه، وليس بالشركة أو العلامة التجارية، وهذا يعني أنه يمكن للفرد استخدام العلامة التجارية بشكل مستمر ومنع الآخرين من استخدامها بدون إذن لحماية حقوقه وحماية العلامة التجارية من التزوير أو الاستخدام غير المشروع.`
                        }
                    ]}
                />
                <BulletContent
                    title={"تسجيل العلامة التجارية"}
                    desc={"يتم استخدام تسجيل العلامات التجارية للشركات والأفراد لحماية حقوقهم والحفاظ على سمعتهم التجارية، وتمنح تسجيلات العلامات التجارية حقوقًا حصرية لاستخدام العلامة التجارية وفقًا للفئات التي تم تسجيلها فيها، وتساعد في منع الغش والتزوير والتلاعب في السوق."}
                    items={
                        [
                            {
                                title: "بالنسبة للشركة",
                                desc: `
تسجيل علامة تجارية لشركة يتم عن طريق تقديم المحامي تخصص علامات تجارية بطلب لإدارة الملكية الفكرية في البلد المعني، ويتم تسجيل العلامة التجارية تحت اسم الشركة.وتهدف هذه العلامة التجارية إلى حماية المنتجات والخدمات التي تقدمها الشركة من الاستخدام غير القانوني أو الاحتيالي من قبل الآخرين. وتمنح تسجيلات العلامات التجارية للشركات حقوق حصرية على استخدام العلامة التجارية وفقًا للفئات التي تم تسجيلها فيها.`
                            },
                            {
                                title: "بالنسبة للفرد",
                                desc: `

يمكن للشخص تسجيل العلامة التجارية باسمه الخاص واستخدامها في المنتجات أو الخدمات التي يقدمها. وتهدف هذه العلامة التجارية إلى حماية المنتجات أو الخدمات التي يقدمها الشخص من الاستخدام غير القانوني أو الاحتيالي من قبل الآخرين.`
                            }
                        ]
                    }
                />
                <BulletContent
                    title={"المسئولية القانونية"}
                    items={[
                        {
                            title: "بالنسبة للشركة",
                            desc: `
عند تسجيل العلامة التجارية لشركة، فإن المسؤولية القانونية عن استخدام تلك العلامة التجارية تقع على الشركة نفسها، وليس على أي فرد من أعضاء الشركة. وتعتبر الشركة ككيان قانوني مستقل عن أعضائها، ولذلك فإن المسؤولية القانونية تقع على الشركة ككيان قائم بذاته. ويمكن للشركة اتخاذ الإجراءات القانونية ضد المخالفين، وتتضمن ذلك مطالبتهم بالتوقف عن استخدام العلامة التجارية وتعويض الشركة عن الأضرار التي لحقت بها.`
                        },
                        {
                            title: "بالنسبة للفرد",
                            desc: `

عند تسجيل العلامة التجارية لشخص بعد توكيله لمحامي علامة تجارية، فإن المسؤولية القانونية تقع على الشخص المسجل باسمه، ولا يمكن لأي شخص آخر استخدام العلامة التجارية المسجلة دون إذن من الشخص المسجل باسمها. ويتحمل الشخص المسجل المسؤولية القانونية عن استخدام العلامة التجارية وحمايتها من الانتهاكات المحتملة. وعند حدوث انتهاك لحقوق العلامة التجارية المسجلة يمكن للشخص اتخاذ الإجراءات القانونية ضد المخالفين، وتتضمن ذلك مطالبتهم بالتوقف عن استخدام العلامة التجارية وتعويض المسجل عن الأضرار التي لحقت به. ومن المهم بالنسبة للشخص المسجل أن يحرص على حماية علامته التجارية من الانتهاكات المحتملة والحفاظ على سمعتها التجارية.`
                        }
                    ]}
                />

            </div>
        </>
    );
}

export default ArticleServiceThree;