import LineCard from "@/components/about/aboutMilestonesSection/LineCard";

import styles from "@/components/about/aboutMilestonesSection/aboutMilestonesSection.module.css";
import MilestoneCard from "./MilestoneCard";
import MilestoneImage from "./MilestoneImage";
const cardInfo = [
  {
    year: "1986",
    title: "إطلاق مكتب المحامي محمد أبو ضيف الأول بالأسكندرية",
    desc: "في مارس من عام 1986 قام المحامي محمد أبو ضيف بتأسيس أول مكتب محاماة باتخاذ مقر له في مدينة الإسكندرية، ليكون شعار المكتب الأول توفير الحماية القانونية للموكلين",
    imagePath : "/assets/images/about/alex.png",
    alt : "المكتب الأول للمجموعة التجارية والبحرية",
  },
  {
    year: "1996",
    title: "إطلاق المكتب الثاني في قلب مدينة القاهرة",
    desc: "تم إفتتاح مكتبنا الثاني للمحاماة والاستشارات القانونية في مدينة القاهرة الكبري ليصبح المقر الرئيسي للمكتب في قلب المدينة وذلك لنوسع من نطاق أعمالنا في كافة المدن المصرية",
    imagePath :"/assets/images/about/cairo.png",
    alt : "المكتب الثاني لمجموعة TCMG بالقاهرة" 
  },
  {
    year: "2005",
    title: "بناء فريق عمل متكامل من أكبر المحامين والمستشارين",
    desc: "إستقطب المكتب نخبة من أكبر محامين مصر والمتخصصين في مجالات القانون المختلفة رافعًا شعار تقديم مستوى جديد من الحلول القانونية عالية المستوى بطريقة فريدة ومبتكرة",
    imagePath : "/assets/images/about/building.png",
    alt : "بناء فريق متكامل", 
  },
  {
    year: "2008",
    title: "الإطلاق الأول للمجموعة التجارية والبحرية للمحاماة",
    desc: "تم إطلاق المجموعة التجارية والبحرية للمحاماة بكل قوة بغرض تقديم خدمات قانونية بمعايير عالمية المستوى لخدمة العملاء الكرام على الصعيد المحلي والدولي وسعياً من فريق العمل بأن تصبح أكبر مكتب محاماة دولي في مصر.",
    imagePath : "/assets/images/about/space.png",
    alt : "لإطلاق الأول للمجموعة التجارية والبحرية"
  },
  {
    year: "2016",
    title: "الاحتفال بمرور 30 عاماً من العطاء القانوني",
    desc: "احتفل المكتب بمرور 30 عاماً من العطاء القانوني للعملاء الكرام من الأفراد والشركات والمؤسسات في مصر والشرق الأوسط وبكون المجموعة أعرق مكتب محاماة مصري يدعم الموكلين منذ 1986 في كل المدن المصرية والعربية.",
    imagePath : "/assets/images/about/anniversary.png",
    alt : "30 عام من العطاء القانوني",
  },
  {
    year: "2020",
    title: "بروتوكول تعاون دولي مع مكتب زايد الشحي بالإمارات",
    desc: "بدء المكتب بروتوكول تعاون دولي مع مكتب المحامي زايد الشحي في دبي بالإمارات العربية المتحدة بغرض التوسع في العطاء القانوني في مصر والشرق الأوسط، ولكي يصبح مكتبنا أحد أفضل مكاتب المحاماة الدولية في مصر.",
    imagePath:"/assets/images/about/Maskgroup.png",
    alt : "تعاون دولي مع مكتب زايد الشحي بالإمارات"
  },
  {
    year: "2023",
    title: "بروتوكول تعاون دولي مع الجبار و المزارقة للمحاماة في الرياض",
    desc: "بدء المكتب بروتوكول تعاون دولي مع الجبار و المزارقة للمحاماة في الرياض بالمملكة العربية السعودية بغرض التوسع في العطاء القانوني في مصر والشرق الأوسط، ولكي يصبح مكتبنا أحد أفضل مكاتب المحاماة الدولية في مصر.",
    imagePath : "/assets/images/about/anniversary2.png",
    alt : "تعاون دولي مع الحبار و المزارقة بالرياض",
  },
  {
    year: "2024",
    title: "بروتوكول تعاون دولي مع شركة سيتشوان ينجلينج هيشي للمحاماة",
    desc: `
    بدء المكتب بروتوكول تعاون دولي مع سيتشوان ينجلينج هيشي
    في الصين بتشغندو بغرض التوسع في العطاء القانوني على النطاق الدولي،
    ولكي يصبح مكتبنا أحد أفضل مكاتب المحاماة الدولية في مصر.
  `,
  imagePath : "/assets/images/about/Maskgroup2.png",
  alt : "تعاون دولي مع سيتشوان ينجلينج هيشي في الصين"
  },
  {
    year : "2024",
    title : "بروتوكول تعاون دولي مع ذا ويلث تيلر لخدمات رجال الأعمال",
    desc : "بدء المكتب بروتوكول تعاول دولي مع  ذا ويلث تيلر في دبي  بالإمارات العربية المتحدة بغرض  التوسع في العطاء القانوني في مصر والشرق الأوسط.",
      imagePath : "/assets/images/about/anniversary5.png",
      alt : "بروتوكول تعاون دولي مع ذا ويلث تيلر لخدمات رجال الأعمال",
    },
  {
    year : "2024",
    title : "بروتوكول تعاون دولي مع فريحات للمحاماة",
    desc : "بدء المكتب بروتوكول تعاول دولي مع فريحات للمحاماة بجنين للتوسع في العطاء القانوني في مصر والشرق الأوسط.",
       imagePath : "/assets/images/about/Mask group4.png",
       alt : "بروتوكول تعاون دولي مع فريحات للمحاماة",
      },
  {
    year : "2024",
    title : "بروتوكول تعاون دولي مع شركة المرسي لأعمال المحاماة",
    desc : "بدء المكتب بروتوكول تعاول دولي مع شركة المرسي لأعمال المحاماة عمان بالأردن بغرض  التوسع في العطاء القانوني في مصر والشرق الأوسط.",
    imagePath : "/assets/images/about/anniversary (1).png",
    alt : "بروتوكول تعاون دولي مع شركة المرسي لأعمال المحاماة",

  }
];
const AboutMilestones = () => {
  return (
    <section className={styles.aboutMilestonesSection}>
      <h2>تاريخ المجموعة التجارية والبحرية للمحاماة</h2>
   <div className={styles.cards}>
   {cardInfo.map((card, index) => (
        <div className={styles.aboutMilestoneItem} key={index}>
          {index % 2 === 0 ? (
            <>
              <MilestoneCard year={card.year} title={card.title} desc={card.desc} />
              <LineCard />
              <MilestoneImage path={card.imagePath} alt={card.alt} />
            </>
          ) : (
            <>
              <MilestoneImage path={card.imagePath} alt={card.alt} />
              <LineCard />
              <MilestoneCard year={card.year} title={card.title} desc={card.desc} />
            </>
          )}
        </div>
      ))}
   </div>
    </section>
  );
};

export default AboutMilestones;
