import styles from "@/components/ask-attorny/ask-attrony.module.css"
import Image from "next/image"
const About = () => {
  return (
    <section className={styles.about}>
          <h2>ما هي خدمة اسأل محامي؟</h2>
          <div>
            <p>تعرَّف على الحل القانوني المثالي مع خدمة اسال محامي لمكاتب TCMG للمحاماة. إذا كان لديك استفسار قانوني محير, أو تحتاج إلى إرشاد قانوني سريع وموثوق مهما كانت تساؤلاتك القانونية, فإن خدمة اسأل محامي الخاصة بنا بإمكانها أن تجيب عليها. باستخدام هذه الخدمة، يمكنك طرح استفسارات قانونية لا حصر لها؛ والحصول على إجابات موثوقة ومدروسة من فريقنا المختصّ من المحامين في أي وقت ومن أي مكان داخل مصر والشرق الأوسط. اعتمِد على خبرتنا لتوجيهك في المسائل القانونية ومواجهة تحدياتك القانونية بكفاءة ودقة. استشِر محامي من مكاتبنا, وتمتع بالسلام القانوني والثقة في قراراتك, دون التعرض لأي مساءَلة قانونية أثناء ممارسة أعمالك, أو عيش حياتك كمواطن مطمئن.
            </p>
            <Image src="/assets/images/askattorny/path406.png" alt="/assets/images/askattorny/path406.png" width={192.4} height={86.11}/>
          </div>
    </section>
  )
}

export default About
