import BulletListComponent from "./bulletListComponent/BulletListComponent"

const accessRightsData = {
  title: 'حقوقك في الوصول إلى معلوماتكالشخصية وتحديثها',
  options: [
        `
        تتخذ المجموعة التجارية والبحرية الخطوات المناسبة لتجنب التغييرات غير المصرح بها على المعلومات الشخصية التي ترسلها إلى موقعنا الإلكتروني طالما أن المجموعة التجارية والبحرية تختار الاستمرار في توفير موقعها الإلكتروني.`
        ,
       `
        شريطة أن تمتثل لجميع الاتفاقات المتعلقة باستخدام هذا الموقع الإلكتروني. فإننا سنبذل كل الجهود المعقولة لتزويدك بالوصول عبر الإنترنت إلى بيانات التسجيل الخاصة بك وغيرها من المعلومات الشخصية بحيث  يمكنك عرضها أو تحديثها أو .تصحيحها. `,
        `
        لحماية خصوصيتك وأمانك ، سنتخذ أيضا الخطوات المناسبة للتحقق من هويتك قبل منحك حق الوصول أو تمكينك من إجراء التصحيحات، قد نحتفظ بالمعلومات التي يتم جمعها من خلال موقع المجموعة التجارية والبحرية الإلكتروني فقط طالما كان ذلك مطلوبا للغرض الذي تم توفيره من أجله ، أو كما هو مطلوب لأغراض تجارية مشروعة.`,
        `
      قد يتم الاحتفاظ بمعلوماتك لفترات أطول إذا كانت هناك أسباب قانونية صالحة ، على سبيل المثال إذا كان ذلك .مطلوبا بموجب القانون أو أمر من المحكمة أو للدفاع عن أو متابعة الدعاوى القانونية،`,
    `
      يمكنك إلغاء الاشتراك في تلقي اتصالات التسويق وبحوث السوق في أي وقت باستخدام روابط إلغاء الاشتراك المقدمة أو عن طريق الاتصال بنا على unsubscribe@tcmglaw.com `,
      `      يمكنك أيضا تغيير تفضيلاتك فيما يتعلق بالاتصالات التي تتلقاها منا لمزيد من المعلومات حول حقوقك ، انظر القسم 10 أدناه
`

  ]
}
export default function AccessRights () {
  return (
    <>
    <BulletListComponent {...accessRightsData}/>
    </>
  )
}
