import BulletListComponent from "./bulletListComponent/BulletListComponent"

const agreementData = {
    title: "الاتفاق ، التغييرات",
    options :[
        "من خلال تقديم معلوماتك الشخصية على موقع المجموعة التجارية والبحرية الإلكتروني فإنك توافق على جمع واستخدام معلوماتك الشخصية على النحو الموضح أعلاه.  ",
        "إذا كنت لا توافق ، فيرجى عدم تقديم أي معلومات شخصية عبر موقعنا الإلكتروني.",
        "إذا قررنا تحديث سياسة الخصوصية الخاصة بنا فيجب عليك الإطلاع عليها من حين الي اخر ونحن غير مسؤولين عن اغفالك الجزئي او الكلي لها،",
        " سوف نعلمك عن أي تغييرات كبيرة في طريقة تعاملنا مع المعلومات الشخصية الخاصة بك عن طريق إرسال إشعار إلى عنوان البريد الإلكتروني الرئيسي المحدد الخاص بك في حسابك على موقعنا الإلكتروني أو عن طريق وضع إشعار بارز على موقعنا  أو في هذه الصفحة. "
    ]
}
export default function Agreement() {
  return (
    <>
    <BulletListComponent {...agreementData}/>
    </>
  )
}
