import BulletListComponent from "./bulletListComponent/BulletListComponent"

const childPrivacyData = {
    title: "خصوصية الأطفال",
    options : [
        `
نحن ملتزمون بالامتثال لقانون حماية خصوصية الأطفال علي الإنترنت، موقع المجموعة التجارية والبحرية الإلكتروني وخدماتنا ليست موجهة للأطفال دون سن 18 عاما.`,
" نحن لا نجمع معلومات شخصية عن قصد من الأطفال دون سن 18 عاما.",
"إذا تلقينا معلومات شخصية واكتشفنا أنها مقدمة من طفل دون سن 18 عاما. سوف تدمر على الفور هذه المعلومات.",
"يجب على المدارس وأولياء الأمور الإشراف على أنشطة أطفالهم عبر الإنترنت والنظر في استخدام وسائل أخرى لتوفير بيئة ملائمة للأطفال عبر الإنترنت."
    ]
}
export default function ChildPrivacy() {
  return (
    <>
    <BulletListComponent {...childPrivacyData}/>
    </>
  )
}
