import BulletListComponent from "./bulletListComponent/BulletListComponent"

const communicationData = {
    title: "الاتصالات والحقوق",
    options: [
        `إذا كان لديك حساب عبر الإنترنت علي موقعنا الإلكتروني ، فيمكنك الوصول إلى معلوماتك الشخصية وتحديثها وتصحيحها - بما في ذلك خيارات التسويق الخاصة بك - بأستخدام روابط إدارة الحساب اسفل كل بريد يتم إرساله اليك. يمكنك أيضا اختيار عدم تلقي اتصالات التسويق وأبحاث السوق في أي وقت عن طريق الاتصال بنا على <a href="mailto:unsubscribe@tcmglaw.com">unsubscribe@tcmglaw.com</a>.`,
        `يمكنك إيضا التواصل معنا دائما إذا واجهت إي صعوبات في فهمك لسياسة الخصوصية الخاصة بنا و / أو تقديم طلبات الإبلاغ عن الغرض من استخدام المعلومات الشخصية علي <a href="mailto:dataprivacy@tcmglaw.com">dataprivacy@tcmglaw.com</a>.`,
        `ستتم معالجة طلبات الإبلاغ عن الغرض من استخدام المعلومات الشخصية و / أو الكشف أو التصحيح أو الإضافة أو الحذف أو إنهاء الاستخدام أو المحو وفقًا لإجراءات المجموعة التجارية والبحرية, ولا تكون أو تنشيء هذه السياسة اتفاق بين الموكل والمحامي كما قد وضح أعلاه، هذه السياسة خاصة بالتعامل مع موقع المجموعة التجارية والبحرية الإلكتروني والمعاملات الإلكترونية مع زوار موقعنا الإلكتروني.`
    ]
}

export default function Communication() {
  return (
    <>
      <BulletListComponent {...communicationData} />
    </>
  )
}
