import BulletListComponent from './bulletListComponent/BulletListComponent'

const infoSharingData = {
  title : "تبادل المعلومات",
  options : [
       "نحن لا نبيع أو نؤجر أيًا من البيانات الشخصية التي نجمعها عنك لأطراف ثالثة، الكيان المسؤول عن إدارة واستخدام موقع المجموعة التجارية والبحرية الإلكتروني والمعلومات  هو مكتب فرع العباسية في القاهرة/مصر .ومع ذلك، قد تعمل المجموعة التجارية والبحرية في جميع أنحاء العالم من خلال الشراكات والشركات التابعة لها،",
       " قد تقوم المجموعة التجارية والبحرية أيضا بالإفصاح عن و/أو نقل معلوماتك الشخصية إلى مزودي خدمات الطرف الثالث الموثوق بهم على سبيل المثال ،الشركات التي توفر أنظمة واستضافة المواقع الإلكترونية بما في ذلك المواقع الصغيرة للمجموعة التجارية والبحرية وغيرها من خدمات تكنولوجيا المعلومات، والمستشارين الداخليين والخارجيين والمراجعين."
  ]
}
export default function InfoSharing () {
  return (
    <>
    <BulletListComponent {...infoSharingData}/>
    </>
  )
}
