import BulletListComponent from "./bulletListComponent/BulletListComponent"

const linksData = {
  title: 'الروابط',
  options : [
      `
        يتم توفير ارتباطات لمواقع الويب التي لا يتم تشغيلها من قبل المجموعة التجارية والبحرية ("مواقع الطرف الثالث") فقط للراحة لك.  
      `,
      `
        إذا كنت تستخدم هذه الروابط ، فستترك موقعنا الإلكتروني للذهاب اليها. لا تنطبق سياسة الخصوصية هذه على مواقع الطرف الثالث.  
      `,
     'لم نراجع مواقع الطرف الثالث ، ولا نتحكم ولا نتحمل مسؤولية أي من محتوياتها أو سياسات الخصوصية الخاصة بها ، إن وجدت.',
     'نحن لا نؤيد أو نقدم أي إقرارات بشأنهم أو أي معلومات أو برامج أو غيرها من المنتجات أو المواد الموجودة هناك ، أو أي نتائج قد يتم الحصول عليها من استخدامها.',
     'إذا قررت الوصول إلى أي من مواقع الطرف الثالث .المدرجة على موقعنا الإلكتروني أو المرتبطة بها ، يجب أن تفهم أنك تفعل ذلك على مسؤوليتك الخاصة'

  ]
}
export default function Links () {
  return (
   <>
   <BulletListComponent {...linksData}/>
   </>
  )
}
