import BulletListComponent from "./bulletListComponent/BulletListComponent"

const securityData = {
    title: "الأمن",
    options : [
        "يستخدم موقعنا الإلكتروني التدابير المناسبة لحماية معلوماتك الشخصية من الوصول غير المصرح به أو الاستخدام غير الصحيح أو الإفصاح أو التدمير غير المصرح به أو غير القانوني أو الفقد العرضي ، ويلتزم موظفينا وأي أطراف ثالثة تعالج معلوماتك الشخصية نيابةً عنا. سرية معلوماتك. ، ",
        "ومع ذلك ،لا يمكننا تقديم أي ضمانات بأن هذه التدابير ستكون كافية  لحماية المعلومات التي تختار نقلها إلى موقعنا الإلكتروني .",
        "إذا قمت بالتسجيل لاستخدام الخدمات عبر الإنترنت على موقعنا الإلكتروني فستكون تفاصيل حسابك محمية بكلمة مرور.تقع على عاتقك مسؤولية الحفاظ على سرية كلمة المرور وأمانها وتسجيل الخروج بمجرد الانتهاء من التصفح. ",
        "موقع المجموعة التجارية والبحرية الإلكتروني ليس مصمم لتخزين المعلومات الشخصية الحساسة مثل الأصل المالي أو الصحي أو الإجرامي أو العرقي أو الإثني أو الانتماء السياسي ، ويجب ألا يستخدم موقعنا الإلكتروني لهذا الغرض"
    ]
}
export default function Security() {
  return (
    <>
    <BulletListComponent {...securityData}/>
    </>
  )
}
