import BulletListComponent from './bulletListComponent/BulletListComponent'
const userData = {
  title: "المعلومات التي تقدمها لنا من خلال موقع المجموعة التجارية والبحرية الإلكتروني",
  desc : " إذا قمت بالانضمام إلى قائمة بريدية أو أكثر أو اخترت تقديم معلومات شخصيةنا من خلال موقعنا الإلكتروني، فسنستخدم هذه المعلومات للغرض الذي جمعت من أجله ووفقا لسياسة الخصوصية في الجزء ذي الصلة من موقعنا الإلكتروني. بالإضافة إلى ذلك ،قد نستخدم معلوماتك الشخصية من أجل:",
  options : [
       "التواصل معك حول أعمالنا",
       "تقديم المشورات والمنتجات والخدمات التي تطلبها ",
       "ندعوك إلى الأحداث وتسجيلك فيها ",
       " إضافتك إلى القوائم البريدية وإرسال المواد التسويقية التي نعتقد أنها ستكون ذات أهمية لك",
       "معالجة والرد على الطلبات والاستفسارات والشكاوى ولأغراض وعمليات أخرى مرتبطة بشكل معقول ، مثل إدارة ومراقبة وتحسين موقع المجموعة التجارية والبحرية الإلكتروني ومنتجاتنا وخدماتنا"

  ]
}
export default function UserProvidedData() {
  return (
   <>
   <BulletListComponent {...userData}/>
   </>
  )
}
