"use client";

import AccordionCard from "@/components/shared/client/accordionCard/AccordionCard";

const data = [
  {
    title: "هل تقدمون خدمات قانونية عبر الإنترنت للأفراد والشركات؟",
    desc: `
في عالم اليوم الرقمي, نوفر خدمات قانونية عبر الإنترنت تسهم في تسهيل الوصول إلى الاستشارات القانونية وإدارة القضايا للأفراد والشركات. يتيح لك موقعنا توكيل محامي والاستفادة من خبراته القانونية الكترونيًا بشكل مريح وآمن؛ مما يوفر لك الوقت والجهد في معالجة الأمور القانونية من أي مكان. من الخدمات القانونية التي نوفرها الكترونيًا.
خدمات للأفراد
عندما يتعلق الأمر بالأفراد, فنحن نقدم دعمًا قانونيًا شاملاً لهم مثل: تأسيس الشركات, حيث نقوم بإعداد العقود واللوائح الداخلية وتقديم الاستشارات القانونية لضمان الامتثال للقوانين المحلية والدولية؛ مما يتيح لك بدء عملك بسلاسة. التقاضي, يمكنك توكيل محامي للحصول على دعمًا قانونيًا فعالًا من خلال موقعنا؛ مما يسمح لك بمتابعة قضاياك والتواصل مع محاميك بكل سهولة. نوفر أيضًا حماية شاملة لحقوق الملكية الفكرية عبر الإنترنت, من تسجيل براءات الاختراع والعلامات التجارية إلى حل النزاعات المتعلقة بها. بالإضافة إلى ذلك, نقدم استشارات قانونية متخصصة في مجال التوظيف لضمان حماية حقوقك في مكان العمل وحل النزاعات العمالية بفعالية. عبر خدماتنا الرقمية، نحرص على تقديم دعم قانوني متميز يناسب احتياجاتك ويساعدك في تحقيق أهدافك الشخصية بأعلى مستويات الأمان والكفاءة.
خدمات الشركات
نقدم عبر الإنترنت أيضًا مجموعة شاملة من الخدمات القانونية للشركات. يمكنك توكيل محامي للحصول ستشارات قانونية متخصصة في مجال الاندماج والاستحواذ؛ لضمان سير العمليات بسلاسة وحماية مصالح شركتك. في مجال الخدمات البنكية والمالية، نوفر استشارات متقدمة لضمان الامتثال للقوانين واللوائح وتعزيز المعاملات المالية بوضوح وشفافية. نقدم أيضًا خدمات التحكيم التجاري لتسوية النزاعات بفعالية؛ مما يوفر لك حلولًا سريعة ومنصفة دون الحاجة إلى الإجراءات القضائية التقليدية. علاوة على ذلك, نُمثل الشركات في جميع مراحل التقاضي, بدءًا من تقديم الدعوى وحتى إصدار الحكم, مع التركيز على تحقيق أفضل النتائج. 
في المجموعة التجارية والبحرية للمحاماة, نحرص على تقديم دعم قانوني متميز يناسب احتياجات كلاً من الأفراد والشركات؛ مما يحقق اهداف الافراد القانونية ويعزز نجاح الشركات في بيئة الأعمال التنافسية هذه.
`,
  },
  {
    title: "ما أهمية عمل توكيل لمحامي متخصص؟",
    desc: `
       تتجلى عملية توكيل محامي في أهميتها؛ فعند التعرض لتجاوزات أو مخالفات للقانون العام أو الخاص, الحل الأمثل هو الاستناد إلى توكيل محامي مختص ومتمرس في القضية القانونية التي يرتكز فيها تخصصه؛ فليس من الوارد لأي مواطن غير مختص في مجال المحاماة مهما بلغت معرفته عن التقاضي والتحاكم أن يتنازل عن اللجوء إلى عمل توكيل محامي متخصص؛ فهو يقوم بالتصرف نيابةََ عن موكله في القضية التي أقدم عليها معتمداً على معلوماته وخبرته القانونية لحماية حقوقه والدفاع عن قضيته سواء تمثلت في ممتلكات أو حقوق أو تعدِِ على الملكية الفكرية أو أي مسائل قانونية أخرى, في مقابل أجر مادي يجب عليه سداده ويتم تحديده بناء على بعض المعايير أهمها قياس المتاعب التي نتجت عن عمل توكيل محامي.
في ظل التعمق في إدراك أهمية توكيل محامي، هناك كثير من الأسباب تدفعك لتجنب تولي شئونك القانونية بمفردك أو بدون التقدم على طلب استشارة قانونية، نقدم فيما يلي أهم الأسباب التي تدفعك لتوكيل أحد المحامين لدينا للتصرف في مسائلك القانونية وذلك أمر لا غنى عنه, وهي:
1. الاحترافية
مهما بدت قضيتك صعبة وليس بإمكانك إيجاد حل قانوني لها، فلا بد من توكيل محامي محترف ذو خبرة كافية في النصوص القانونية والأحكام وذلك تسهيلاً لمسار القضية, وإيجاد حل قانوني فعّال لشأنك القانوني. الاحتراف صفة رئيسية واجبة التواجد في المحامي المتميز وهي إحدى أهم المعايير التي يجب على الموكل اختيار من سيتولى التوكيل عنه في القضايا المعقدة خاصة مثل القضايا الجنائية.
2. الخبرات القانونية
يواجه العديد من الموكلين الغير متخصصين بشكل عميق في دراسة القضايا, صعوبات كثيرة في النظر للمشكلات القانونية التي يُوَكّلون لحلها, وذلك لأن الكشف عن التفاصيل الجانبية والثغرات التي تمثل الحل الأمثل للقضية يعد إحدى مهارات المحامي الخبير في مجال تخصصه.
في مكاتب المجموعة التجارية والبحرية للمحاماة حيث يضم نخبة من المحامين الذين يتمتعون بخبرات قانونية عميقة مترتبة على تلاحقات قضايا سابقة تولوا التوكيل فيها فـ "التجارب هي ما تصنع الخبرة", خاصة نوع القضايا المتشابكة وأكثرها حاجة لخبرة كبيرة هي قضايا النقض التي تحتاج إلى توكيل محامي نقض متخصص ملم بجميع مجالات القانون نظرًا لطبيعة عمل محامي النقض المتفرعة.
3. مقاومة العواطف والتأثيرات الخارجية
يتصف الإنسان بكون طبيعته عاطفية فقد يعالج معظم أمور حياته بمنظور عاطفي نظرًا لقناعته بأنه على حق. لكن هذه العاطفة تمثل تهديدًا لنجاح القضية لأن من المحتمل تعرض المحامي لتعاطفات سلوكية من طرف الخصم لاستماتة المحامي وكسبه إلى جانبه (يحدث هذا فقط مع المحامين الذين يسمحون بسيطرة العاطفة) وتوجيههم إلى طريق خاطئ. أما المحامي المتمكن والدارس لقواعد السلوك داخل المحكمة فهو غير قابل لاستقبال أي تأثيرات خارجية.
4. تشابك العلاقات بين القوانين
كن على علم بأن بنود القوانين ومواده تتسم بالتعقيدة لأنها مليئة بالتفاصيل الكثيرة والمهمة سواء الصغيرة منها أو الكبيرة والتي تحتاج لخبرة عميقة ف"كلما زاد عمق المعرفة أصبحت ذات أثر كبير". ولأن محامونا يتمتعون بشبكة كبيرة من العلاقات والمعارف والمصادر الأساسية لتحصيل المعلومات وتعميق معرفتهم عن القوانين؛ فإنهم قادرون على مساعدتك لفهم أي تفاصيل أو مصطلحات معقدة، وهو ما يصعب توفيره مع محامي مبتدئ.
        `,
  },
  {
    title: "كم تكلفة توكيل محامي ؟",
    desc: `إن تكلفة عمل توكيل محامي للنظر في قضية أو إثبات أحقية الممتلكات خاصة في القضايا العقارية أو أيًا كانت الخدمة المطلوبة؛ فمن المتعارف عليه أن عمل التوكيل عملية مكلفة وذلك يرجع إلى الخبرات والاحترافية التي يتسم بها المحامي وبناءً على المجهود والمدة التي استهلكها في حل القضية يتم تحديد الكلفة وقدرها, كما يتم تحديد رسوم التوكيل حسب نوع وسبب  هذا التوكيل ولأي جهة سيتم إرساله.
سعر توكيل المحامي في الشهر العقاري: إن سعر التوكيل بمصلحة الشهر العقاري تُقدَّر برسوم معينة ويتم تحديد هذه الرسوم من مصلحة الشهر العقاري فقط
سعر توكيل عام وخاص قضايا 2024: يتم تسعير التوكيل العام للقضية الواحدة بناء على عدد الأفراد ومختلف المهن حيث:
الحالة الأولى: إذا كان فردًا واحدًا فسعر التوكيل 31 جنيهًا.
الحالة الثانية: إذا كان الطرف الآخر مختلف المهن فسعر التوكيل العام هو 46 جنيهًا.
الحالة الثالثة: إذا كان التوكيل لفردين فيكون السعر 56 جنيهًا.
الحالة الرابعة: إذا كان التوكيل لثلاثة أفراد فيكون سعر التوكيل العام 61 جنيهًا.
الحالة الخامسة: إذا كان الطرف الآخر مختلف المهن فسعر التوكيل العام هو 81 جنيه.
إذًا يمكن الإقرار أن متوسط سعر توكيل عام قضايا يتراوح بين 30 : 100 جنيهًا.
تسهيلاً على عملائنا الكرام يمكنك الدخول علي الموقع الرسمي لوزارة العدل لمعرفة رسوم توكيل محامي وأخر التحديثات للرسوم الحقيقة والإجراءات اللازمة لعمل توكيل محامي في الشهر العقاري.
`,
  },
  {
    title: "ما الفرق بين التوكيل العام و التوكيل الخاص؟",
    desc: `توكيل عام قضايا للمحامي: يسمح هذا التوكيل للمحامى بتقديم دعوى الرفع للقضية نيابةََ عن الموكل للدفاع عنه فى القضايا التى تُرفع ضده, وممارسة الأعمال المتعلقة بالقضية كالإقرار بالتصالح أو استلام الأوراق وكل ما يخص القضايا المرفوعة من الموكل أو عليه.
عمل توكيل عام قضايا أون لاين: يمكنك من خلال زيارة الموقع الرسمي للمجموعة التجارية والبحرية للمحاماة, بعمل توكيل عام قضايا أون لاين من خلال هذه الصفحة وحجز توكيل عام قضايا, كذلك الحصول على استشارة قانونية بكافة الطرق المتاحة من استشارة هاتفية أو واتس أب عبر الأرقام المتوفرة في صفة الاستشارات القانونية.

التوكيل الخاص للقضايا: يقتصر هذا التوكيل على السماح للمحامي بالحضور والدفاع والمرافعة أو التصالح في قضية معينة, وغير مسموح له بحرية التصرف في إجراءات القضية.
`,
  },
  {
    title:
      "ما هي الطرق المختلفة لعمل توكيل عام أو خاص لمحامي؟ (4 طرق مختلفة وفعالة)",
    desc: `هناك أكثر من طريقة لعمل توكيل لمحامي متخصص، سنعرض أفضل الطرق التي ستمكنك من إجراء توكيل أو الحجز  لإنهاء إجراءات توكيل محامي بنجاح:
عبر الهاتف المحمول دون الاضطرار إلى الانتظار في صفوف الطوابير الطويلة أمام مكاتب التوكيل في الشهر العقاري عن طريق استخدام تطبيق ارغب في عمل توكيل  لحجز معاد لك في مكتب الشهر العقاري وعمل التوكيل الخاص بك دون انتظار دورك ف المكتب (في حالة اذا كان مكتب الشهر العقاري الخاص بمحافظتك مميكناً).
عمل التوكيل عن طريق بوابة مصر الرقمية فمن خلالها يمكنك عمل التوكيل بطريقه سهلة وبسيطة وغير مكلفة من خلال عمل مجموعة من الإجراءات البسيطة.
ولكن اذا كان المكتب غير مميكن فيجب عليك الذهاب الي مكتب الشهر العقاري وعمل التوكيل للمحامي لدينا يدوي مع الموظف المختص هناك. (سواء كنت من داخل او خارج مصر)
الطريقة الأخيرة ألا وهي عن طريق فروع توثيق جديدة تم اطلاقها حديثا تعمل فترة مسائية من الساعة ٥ مساءاً وحتى الساعة التاسعة مساءاً تيسيراً على السادة المواطنين المتعاملين مع قطاع الشهر العقاري والتوثيق عن طريق سيارات متنقلة خاصه بمصلحه الشهر العقاري لتقديم الخدمات للموطنين ويتم الحجز بتلك الفروع من خلال تطبيق أرغب في عمل توكيل أو بوابة مصر الرقمية.
بعد عمل التوكيل، من المهم المتابعة مع المكتب لمعرفة كل جديد وآلية سير القضية الخاصة بك.`,
  },
  {
    title: "هل يجوز عمل توكيل لأكثر من محامي؟",
    desc: "نعم, يمكن لأي شخص عمل توكيل لأكثر من محامي في قضية واحدة, ولا يوجد ما يمنع ذلك أو قانون ينص على إلزام الموكل بعمل توكيل لمحامِِ واحد, لكن من الأفضل مراعاة توكيل المحامين من مكتب محاماة واحد حتى يتم التوافق بينهم وليس من مكاتب محاماة منافسة أخرى لأن ذلك سيمثل تهديدًا لإقامة روح الفريق وقد يسعى كل محامي منفردًا بخبرته للفوز في القضية مما يسبب ذلك تشتتًا في مسار القضية مما قد يعد احتمالاً لعدم تحقيق النصر فيها.",
  },
];

const Accordion = () => {
  return (
    <section className='accordionQuestions'>
      <h2>الأسئلة الشائعة حول الخدمات القانونية</h2>
      {data.map((el,index) => (
        <AccordionCard title={el.title} desc={el.desc} key={index} />
      ))}
    </section>
  );
};

export default Accordion;
