import styles from "./page.module.css"
const HiringHero = () => {
  return (
    <section className={styles.hero}>
        <div className={styles.dt}>
        <h1 >
        انضم إلى فريقنا: اكتشف وظائف المحاماة في TCMG وابنِ مستقبل مهني واعد              
          </h1>
          <p>انضم إلى فريق TCMG واستفد بوظائف قانونية مميزة في عالم المحاماة، حيث نمنحك البيئة المثالية لتطوير مهاراتك وبناء مستقبل مهني واعد. اكتشف الآن كيف يمكن لطموحك أن يتحقق معنا.</p>
        </div>
        <div className={styles.mob}>
          <h1>
          انضم إلى فريقنا:
          </h1>
          <h2>
          اكتشف وظائف المحاماة في TCMG وابنِ مستقبل مهني واعد
          </h2>
          <p> 
          انضم إلى فريق TCMG واستفد بوظائف قانونية مميزة في عالم المحاماة، حيث نمنحك البيئة المثالية لتطوير مهاراتك وبناء مستقبل مهني واعد. اكتشف الآن كيف يمكن لطموحك أن يتحقق معنا.          </p>
        </div>
      </section> 
  )
}

export default HiringHero
