import styles from "./page.module.css"
const ConsultHero = () => {
  return (
    <section className={styles.hero}>
    <div className={styles.content}>
      <h1>
      استشارة قانونية بمعايير عالمية المستوى
      </h1>
      <p>
      هل تبحث عن رقم مستشار قانوني خبير لطلب استشارة قانونية فورية حول مشكلة قانونية معينة؟ لا مزيد من البحث فقد وجدت وجهتك مع المجموعة التجارية والبحرية أكبر مكتب استشارات قانونية في مصر. حيث يضم مكتبنا مجموعة من خبراء القانون والمستعدون لتقديم معارف وخبرات أكثر من 30 عاماً لعملائنا الكرام بغرض حل قضاياهم وتحقيق أهدافهم القانونية. احجز الآن استشارات قانونية من مكاتب TCMG واحصل على دعم قانوني قوي.
      </p>
    </div>
  </section>
  )
}

export default ConsultHero
