"use client";
import AccordionCard from "@/components/shared/client/accordionCard/AccordionCard";


const data = [
  {
    title : "ما هي الاستشارات القانونية؟",
    desc : `الاستشارة القانونية: هي الآلية الفعّالة لحل الخلافات والنزاعات بطريقة ودّية دون الحاجة لتدخل قانوني من القضاء والمحكمة؛ فهي إحدى طرق الإصلاح فيما يخص الأسس القانونية في الشركات والمؤسسات, كما يعد تقديم طلب استشارة قانونية خطوة أولى في نجاح أي استثمار أو مشروع ما يتقدم عليه رجل أعمال, حيث يحرص المستشار على اطلاع المستثمر على كافة الإجراءات القانونية التي يجب اتباعها لعدم التعرض لمخالفة قانونية, ومن هنا يمكن الإشارة إلى أن للاستشارة القانونية يد في نجاح المشروعات والشركات بطريقة غير مباشرة.
لا يقتصر تقديم المشورة على المؤسسات فقط؛ فهي تعد داعم قوي للأفراد بشكل عام في حل القضايا الشخصية منها والعلاقات, حيث يصبح العميل أكثر دراية على حقوقه التي يجب المطالبة بها, ولا نتجاهل اطلاعه على الواجبات الواقعة عليه بما ينص عليه القانون, كما يحصل من خلالها العميل على اقتراحات ونصائح مُدعّمة بالقانون العام في مصر مما يعني أنّ الأخذ بها ضرورة مؤكّدة على كل متقدّم على طلبها.`
  },
  {
    title : "من هو المستشار القانوني؟",
    desc : `المستشار القانوني: هو المتخصص في تقديم الاستشارات القانونية بجانب قدرة المحامي على تقديمها, وهو يمثل يد العون في تقديم الدعم القانوني لكل متقدم على طلبها, كما أنه سهم التوجيه لتقديم النصح بناءً على القانون وبنوده فيما يخص كل مجال على حدى.
تندرج المهمة الأساسية للمستشار القانوني في تقديم المساعدة القانونية استنادًا على القواعد والخبرة الكافية في المجال المتخصص به, ومن صفات المستشار الناجح الرئيسية كونه قادر على إنشاء حلقة تواصل قوية بينه وبين العميل, بالإضافة إلى تسلّحه بمهارة الاستماع والإصغاء الجيدة, وتمتعه بمقدرة على تحليل معطيات الواقعة والأحداث التي قام بشرحها العميل, والقدرة على طرح الأسئلة بطريقته الخاصة؛ لكشف بعض الأمور الخفية في القضية المطروحة, والتوصل إلى حلول قانونية مثمرة ذات فائدة لمصلحة العميل بشكل عام والبيئة من حوله, ويتم تقديم هذه الخدمة القانونية على مستوى الأفراد والشركات والمؤسسات.`
  },
  {
    title : "ما أهمية الاستشارات القانونية بشكل عام؟",
    desc : `قد يتجاهل البعض أهمية الحصول على الاستشارات القانونية ويتسرّعون بطلب توكيل محامي في القضية التي يواجهونها, مما قد يمثِّل اتخاذ هذا القرار الخاطئ التي تم بناؤه دون مشورة متخصص, في هذه الحالة قد ينتهي الأمر بصورة كارثية وكان من الممكن أن ينتهي بنصيحة أو رأي من مستشار قانوني. من هنا يبرز دور الاستشارة القانونية والذي يتلخص في بعض النقاط هي:
مساعدة العاجز عن اتخاذ القرار المناسب لموقفه وقضيته, هذا القرار الذي يتحتم اتخاذه على أساس قانوني سليم.
تقديم الحل القانوني حسب ملائمته مع الموقف أو القضية التي يواجهها العميل.
عرض المحامي أو الاستشاري وجهة نظره حول الإجراء الصحيح الذي سوف يعتمده العميل من خلال حصوله على استشارة قانونية فورية, ويقع تنفيذ هذا الإجراء على موافقته أو رفضه؛ ففي النهاية الاستشارة القانونية عبارة عن آلية لعرض الرأي القانوني وليس الإجبار عليه.
يساعد الحصول على استشارة قانونية مكتبية في مكتب الاستشارات القانونية في مصر في تمكين المستشار من عرض مستندات ووثائق لدعم رأيه بإثباتات مرئية مما يساعد ذلك العميل في اتخاذ الإجراء الصحيح.
ترجع أهمية الاستشارة القانونية إلى كونها أحد الحلول الوقائية الفعالة والمعتمدة من قبل الأفراد حول العديد من التخصصات منها العلاقات الأسرية والأحوال الشخصية أو المسائل المتعلقة بالقضايا المدنية, كذلك من قبل الشركات والمؤسسات على مجال أوسع من التخصصات منها استشارة قانونية مصرية ما قبل تأسيس شركة في مصر أو تقديم الدعم القانوني لرجال الأعمال والمستثمرين, لم يتم تخصيص الاستشارات القانونية لفئة معينة من الناس؛ فهي متاحة للجميع في شتى المجالات الحياتية والعملية.
`
  }
]
const Accordion = () => {
  return (
    <section className="accordionQuestions">
      <h2>الأسئلة الشائعة حول الخدمات القانونية</h2>
      {data.map((el,index) => (
        <AccordionCard title={el.title} desc={el.desc} key={index} />
      ))}
    </section>
  );
};

export default Accordion;
