"use client";
import AccordionCard from "@/components/shared/client/accordionCard/AccordionCard";


const data = [
  {
    title : "ما هي الاستشارات القانونية؟",
    desc : `<p>
    <strong>الاستشارة القانونية: </strong>
هي منهجية فعّالة لحل الخلافات والنزاعات بشكل ودّي، دون الحاجة للتدخل القضائي, كما أنها تعتبر خطوة أولى مهمة لنجاح أي استثمار أو مشروع، حيث يطَّلع المستشار على الإجراءات القانونية الضرورية لتجنب المخالفات. كما أن أي اسشارة قانونية تدعم الأفراد في حل القضايا الشخصية وتزيد من وعيهم بحقوقهم وواجباتهم القانونية. بالتالي، توفر الاستشارة القانونية اقتراحات ونصائح مدعومة بالقانون العام؛ مما يجعلها ضرورية لكل من يطلبها.
    </p>
    `
  },
  {
    title : "من هو المستشار القانوني؟",
    desc : `
    <p>
    <strong>المستشار القانوني: </strong>
    هو متخصص يقدم استشارات قانونية متخصصة، ويعمل كداعم قانوني لكل من يحتاج إلى المساعدة. تتمثل مهمته الأساسية في تقديم المساعدة القانونية بناءً على قواعد وخبرة متعمقة في مجاله. يجب أن يتمتع المستشار الناجح بمهارات تواصل فعّالة مع العميل، والقدرة على الاستماع الجيد، وتحليل المعطيات المطروحة. كما يُسهم في كشف الأمور الخفية في القضايا؛ مما يؤدي إلى استشاره قانونيه مثمرة تعود بالفائدة على العميل والبيئة المحيطة. تُقدَّم هذه الخدمة القانونية للأفراد والشركات والمؤسسات.
    </p>
    `
  },
  {
    title : "ما أهمية الاستشارات القانونية بشكل عام؟",
    desc : `
    <p>
   <ul>
    <li><strong>تجنب القرارات المتسرعة:</strong> بعض الأشخاص يتجاهلون أهمية الاستشارات القانونية ويفضلون توكيل محامي دون مشورة؛ مما قد يؤدي إلى عواقب كارثية.</li>
    <li><strong>مساعدة في اتخاذ القرار:</strong> الحصول على استشارة قانونية يساعد العاجزين عن اتخاذ القرارات المناسبة بناءً على موقفهم القانوني.</li>
    <li><strong>تقديم حلول قانونية مناسبة:</strong> المستشار يعرض الحلول القانونية الملائمة لحالة العميل.</li>
    <li><strong>وجهة نظر المستشار:</strong> يوفر المحامي وجهة نظره حول الإجراء الصحيح، حيث يظل قرار التنفيذ بيد العميل.</li>
    <li><strong>دعم بالوثائق:</strong> الاستشارة القانونية المكتبية تُمكِّن المستشار من عرض مستندات تدعم رأيه؛ مما يساعد العميل في اتخاذ القرار الصحيح.</li>
    <li><strong>حلول وقائية:</strong> تعتبر الاستشارات القانونية حلولاً وقائية فعالة في مجالات متعددة، مثل العلاقات الأسرية، الأحوال الشخصية والقضايا المدنية.</li>
    <li><strong>تقديم الدعم للمؤسسات:</strong> تشمل الاستشارات القانونية أيضًا دعم الشركات ورجال الأعمال لتأسيس شركة في مصر.</li>
    <li><strong>متاحة للجميع:</strong> الاستشارات القانونية ليست مخصصة لفئة معينة، بل متاحة للجميع في مختلف المجالات الحياتية والعملية.</li>
</ul>
</p>

    `
  },
  {
    title : "ما أهمية الاستشارة القانونية للأفراد؟",
    desc : `
    <p>تعتبر الاستشارة القانونية في مصر ضرورية لحماية حقوق الأفراد وتجنب النزاعات، خاصة في مجالات مثل النزاعات الأسرية، قضايا الأحوال الشخصية (كالطلاق والحضانة)، والمعاملات المالية والتجارية. يساعد المستشار القانوني في تقديم نصائح وحلول مستندة إلى تحليل شامل للمشكلة؛ مما يمكّن العميل من اتخاذ القرارات المناسبة قبل الإقدام على توكيل محامي.</p>
    <p>يمكن للأفراد داخل مصر التواصل مباشرة مع مستشارين متخصصين من مكتب محاماة للاستشارات القانونية، سواء بزيارة المكتب أو عبر رقم الهاتف المتاح. كما يُتيح للمغتربين الحصول على الاستشارات القانونية عبر الإنترنت؛ مما يسهل الوصول إلى الدعم القانوني في أي وقت ومن أي مكان.</p>
    `
  },
  {
    title : "ما أهمية الاستشارات القانونية للأفراد والشركات؟",
   desc : `
   <p>تتخصص مكاتب المجموعة التجارية والبحرية وهي مكتب محاماة واستشارات قانونية نقدم خدماتنا في كافة مجالات وأفرع القانون من جنائي، دولي، مدني، عقاري، مالي وأسري وغيرها الكثير من أقسام القانون في مصر، كما تقدم مكاتبنا الخدمات القانونية للدول الخليجية منها: السعودية، الإمارات، الكويت، البحرين، قطر وعمان، لتغطية نطاق واسع من الدول وتوصيل خدمة الاستشارات القانونية لجميع عملائنا من الخليج والدول العربية بكافة أنواعها من:</p>
   <ul>
    <li><strong>استشارة قانونية عقارية:</strong> إذا كنت تواجه مشكلة في إثبات ملكيتك لعقارك، وتعرضت لادعاء ينفي أحقيتك في الملكية أو غيرها من المنازعات العقارية، تقدم بطلب استشارة محامي عقارات بالقاهرة؛ فهو الدليل الأنسب لحل هذه المشاكل القانونية. لا تعتمد على إخباريات أي شخص غير متخصص، فالمحامي والمستشار المتخصص في العقارات هو الشخص الجدير بتقديم الحلول الفعالة لمشاكلك.</li>
    
    <li><strong>استشارة محامي شركات:</strong> إذا كنت ترغب في بناء الأساس القانوني لشركتك الخاصة، فإن خدمة استشارات الأعمال هي أفضل الخدمات المبدئية لتكوين صورة واضحة حول الإجراءات المطلوبة. وهي خطوة رئيسية قبل بدء أي تاجر أو مستثمر في تأسيس الشركات. كما يمكن لاستشارة محامي الشركات تقديم مساعدة كبيرة في الإرشادات اللازمة لبناء أساس قانوني قوي وتجنب المخالفات القانونية المستقبلية.</li>
    
    <li><strong>استشارة قانونية دولية:</strong> يتقاطع دور المحامي الدولي في مصر مع دور محامي الأسرة في تنظيم العلاقات، لكن الاختلاف يكمن في نطاق العمل. بينما ينظم محامي الأسرة علاقات الأفراد، ينظم المحامي الدولي العلاقات بين الأفراد والشركات في نشاط التجارة الدولية. من خلال استشارة قانونية مع فريقنا، يمكنك الحصول على خيارات وحلول في القانون الدولي، وإرشادك لاختيار بين القضاء الدولي أو التحكيم التجاري الدولي لفض النزاعات.</li>
    
    <li><strong>استشارة زواج الأجانب:</strong> لكل من يرغب في الزواج من أجنبية ولا يعلم قانون زواج الأجانب في مصر، يمكنك طلب الاستشارة وسيتواصل معك محامي زواج أجانب لتقديم المشورة القانونية والدعم اللازم لإتمام كافة الإجراءات بشكل سليم.</li>
</ul>

   `
  },
  {
    title : "ما هو سعر استشارات قانونية من TCMG؟",
    desc : `
    <p>تعد الاستشارات القانونية أحد أبرز الخدمات التي يقدمها أي مكتب محاماة، نظرًا لما تحمله من أهمية كبرى في اتخاذ القرارات الصادرة عن أفواه أكثر المحامين خبرةً، ومعرفة الحجم الصحيح للقضية حول ما إن كانت تتطلب تدخل قانوني عن طريق رفع الدعوى أم تكفي الاستشارة لحل المشاكل القانونية، ذلك من خلال التواصل عبر رقم محامي متخصص (نتيح الرقم على صفحتنا الرسمية للمجموعة)، مع التعرف على سعر الاستشارة القانونية في مصر منها: </p>
    <ol>
    <li><strong>استشارة قانونية هاتفية:</strong> يوفر هذا النوع من الاستشارات التواصل مع محامي متخصص في المجال القانوني الذي ترغب بالتساؤل عنه، من خلال الاتصال على الرقم الذي نعرضه في هذه الصفحة. يمكنك الحصول على إجابات لتساؤلاتك واقتراحات ينصحك بها المستشار القانوني الخبير. سعر الاستشارة الهاتفية هو 499 جنيه فقط، وتمكّن العملاء من خارج مصر أو من لا يمكنهم التواصل مباشرةً مع أحد محامين مكتب استشارات قانونية TCMG من الحصول على الاستشارة عبر الهاتف. <a href="tel:+201276299998">اتصل الآن بمستشارنا القانوني على +201276299998</a>.</li>

    <li><strong>استشارة قانونية أون لاين:</strong> نقدم في مكتبنا استشارات قانونية أون لاين لمساعدتك في الحصول على المشورة من منزلك أو مكتبك دون الحاجة لبذل أي مجهود. وهي استشارة مخصصة في حال كنت تواجه قضية شخصية أو تجارية أو أسرية، حيث يمكنك التواصل مع محامي مختص عبر الإنترنت لتوضيح كافة استفساراتك وطرح قضيتك القانونية. سعر جلسة الاستشارة هو 999 جنيه، ويشمل ذلك مراجعة مستنداتك وتقديم الاستشارة القانونية المتخصصة التي تناسب حالتك.</li>

    <li><strong>استشارة قانونية مكتبية:</strong> تتميز هذه الاستشارة بكونها أكثر أنواع الاستشارات المحلية وذات نتائج أفضل. يمكنك في حال سمحت لك ظروفك من زيارة إحدى فروع مكاتبنا وحجز موعد للمقابلة الشخصية مع المحامي أو المستشار القانوني، حيث يمكنه اطلاعك على الحلول مع إثباتات صحتها وفعاليتها. سعر استشارة محامي هو 1999 جنيه، ويمكنك اللجوء إلى هذه الخدمة في حال اتسمت القضية بالتشابك والتعقيد.</li>

    <li><strong>استشارة قانونية شركات:</strong> نتشرف في مكتبنا TCMG بتقديم خدمة الاستشارات القانونية للشركات لمساعدة المؤسسات، وخاصة الشركات الناشئة، لتوجيهها للامتثال القانوني على النطاق المحلي والدولي. نقدم الاستشارات القانونية بشكل متخصص يشمل إعداد ومراجعة العقود، بالإضافة إلى التوجيه في الأمور التنظيمية وحل النزاعات التجارية. تكلفة الاستشارة القانونية هي 1999 جنيه.</li>
</ol>

    `
  },
  {
    title : "لماذا نقدم الاستشارات القانونية بشكل مدفوع؟",
    desc : `
    <p>موضوع الاستشارة القانونية هو أمر يتطلب بحثًا عميقًا ومشاركة المعرفة بين خبراء مكتبنا القانونيين. عندما يواجه العميل قضية قانونية معقدة أو يحتاج إلى اتخاذ إجراء قانوني سريع، فإن الحصول على استشارة قانونية مؤهلة يمكن أن يكون حاسمًا.
في هذه الحالات، تعتبر الاستشارات القانونية خدمة متخصصة يتم توفيرها من خلال فريقنا القانوني المتمرس. يتم استناد التكلفة المادية للاستشارة إلى حجم وتعقيد القضية والوقت والجهد الذي يستغرقه فريقنا القانوني لتقديم الخدمة المطلوبة.
يتضمن هذا الأجر المادي البسيط تقديم الخبرة والمشورة القانونية المتخصصة، والتحليل العميق للقضية، والبحث المستفيض في النصوص القانونية ذات الصلة، وتقديم التوجيه القانوني الذي يساعد العميل على اتخاذ القرارات المناسبة.
بالنهاية، يعتبر الاستشارة القانونية استثمارًا قيمًا يضمن حماية حقوق ومصالح العميل وتوجيههم نحو الحلول القانونية الصحيحة. إذا كانت لديك حاجة للاستشارة القانونية، فإن فريقنا القانوني سيكون على استعداد لتقديم المساعدة المهنية والخبرة اللازمة لحل مشكلتك بطريقة فعالة وقانونية.
</p>
    `
  },
  {
    title : "هل تقدم المجموعة الاستشارات القانونية للعملاء خارج مصر؟",
    desc : "نعم، تقدم مكاتب المجموعة التجارية والبحرية للمحاماة خدماتنا القانونية منها استشارة محامي مصري، لكل دول الشرق الأوسط والخليج العربي، حيث نتيح الاستشارات القانونية بكامل الدعم القانوني مع مستشار قانوني مصري قادر على الإجابة بشكل دقيق وواضح فيما يتعلق بالقضايا القانونية المختلفة، وما يتبادر لذهنك من استفسارات في القانون الخاص بكل دولة."
  }
]
const Accordion = () => {
  return (
    <section className="accordionQuestions">
      <h2>الأسئلة الشائعة حول الخدمات القانونية</h2>
      {data.map((el,index) => (
        <AccordionCard title={el.title} desc={el.desc} key={index} />
      ))}
    </section>
  );
};

export default Accordion;
