"use client";

import AccordionCard from "@/components/shared/client/accordionCard/AccordionCard";
import styles from "./establishLegalService/page.module.css";

const data = [
  {
    title: "هل نقدم خدمة تأسيس الشركات بالهيئة العامة للاستثمار؟",
    desc : `
    <p>نعم, حيث نسعى في المجموعة التجارية والبحرية للمحاماة إلى توفير مجموعة واسعة من الخدمات والتي منها خدمة تأسيس الشركات بالهيئة العامة للاستثمار.
والتي يشرف على تقديمها أفضل مكتب تأسيس شركات في مصر بمساعدة محامين على درجة عالية من الخبرة. فهي نقطة انطلاقة كبيرة لبناء كيان اقتصادي ناجح في إدارة المشروعات الاستثمارية من خلال البوابة الإلكترونية للهيئة العامة للاستثمار المستندة على قانون الاستثمار الذي ينص على توفير سبل للضمان والحماية لحفظ حقوق المستثمرين, بالإضافة إلى قانون الشركات فهو أحد الأنظمة لبيئة الاستثمار والتجارة.
</p>
<p>يتولى المحامي تحديد رسوم تأسيس الشركات بالهيئة العامة للاستثمار بناءً على الاتعاب والخدمات التي قدمها غير تكاليف تأسيس شركة في مصر  أو خدمة تأسيس شركة في دبي (الإمارات) أو خدمة تأسيس شركة في السعودية للأجانب أو غير الأجانب.</p>
    `
  },
  {
    title: "ما أنواع الشركات التي نقدم خدمة تأسيس الشركات بها؟",
    desc: `
    <p>يمثل تحديد النشاط التجاري الذي تمارسه الشركة الناشئة أول درجات عملية التأسيس لأن عليه سيتم تحديد باقي عناصر الإنشاء؛ فلا تنهض أي شركة أو مؤسسة دون تحديد طبيعة العمل.</p>
    <ul>
    سنعرض لك بعض أنواع الشركات:
    <li>
        <strong>تأسيس شركة فردية:</strong> 
        والتي تسمى أيضاً بشركة الشخص الواحد وهي أحد مشاريع الاستثمار الصغيرة التي يقوم عليها رجل أعمال واحد بدعم مالي بسيط مقارنة بالشركات المتوسطة والكبيرة, وهو نوع التجارة الذي يقوم عليه فرد واحد ترجع إليه كل العوائد المادية, كما تقع على كل الشئون الإدارية والمالية، سواء أكان رائد الأعمال يهدف لتأسيس شركة إلكترونية أو عادية.
    </li>
    <li>
        <strong>تأسيس شركة مساهمة:</strong> 
         تقوم شركات المساهمة على مجموعة من المساهمين باستثمار أسهمهم في تلك الشركة ويكون لكل منهم شهادة تثبت أحقيته في امتلاك أسهم في الشركة, ولا يتم تحديد المساهمين على شركاء التأسيس فقط بل يمكن لأي صاحب أسهم ورؤوس المال أن يساهم في هذا المشروع.

    </li>
    <li>
        <strong>تأسيس شركة ذات مسئولية محدودة:</strong> 
        يعد نوع الشركات ذات المسؤولية المحدودة النوع الأكثر  انتشارًا في العالم لما له من سياسة تطبيق خاصة, تتيح انضمام العديد من رجال الأعمال أو الشركات أو كلاهما معًا كل حسب اختصاصه وسلطته وحسابه من رأس المال الذي قام بمشاركته في تأسيس الشركة. يتم تحديد نظام وسياسة التأسيس بناءً على قانون تأسيس الشركات في كل دولة. 
    </li>
    <li>
        <strong>وباقي أشكال الشركات . . </strong> 
    </li>

    </ul>
    <p>هل لديك أي استفسارات ترغب في معرفتها؟ اضغط على الرابط التالي للتوجه لصفحة اسأل محامي التي ستمكنك من كتابة كل أسألتك والحصول على الإجابات الوافية من خبراء مكتب تأسيس شركات في TCMG.</p>
    `,
  },

{
  title : "هل يقدم مكتبنا خدمة تأسيس شركة في الإمارات (دبي تحديداً)؟",
  desc : `نعم، تقدم مكاتب المجموعة التجارية والبحرية للمحاماة خدمة تأسيس شركة في في الإمارات (خاصة دبي), يرجع ذلك إلى أن المكتب له بروتوكول تعاون دولي مع مكتب زايد الشحي بالإمارات, مما يسمح ذلك لمحامي الشركات لدينا بقدرته على التأسيس في الإمارات سواء كان لعميل مصري أو أي جنسية أخرى ضمن شروط تأسيس شركة في دبي للأجانب تلك الشروط التي تختلف في مصر عن الإمارات تباعًا لقانون التأسيس في الدولة, ويتم تحديد كلفة تأسيس شركات في دبي حسب نوع الشركة من الأنواع التي ذكرناها حيث يختلف حجم كل شركة وعليه تختلف التكلفة.
تمتلك الإمارات شهرة واسعة في تقدمها في المجال التجاري والاستثماري مما يقبل العديد من رجال الأعمال لكافة الجنسيات من الشرق الأوسط على تأسيس شركاتهم فيها لمعرفتهم عن مميزات فتح شركة في دبي وما تمنحه من حقوق, ولا تقتصر تقديم خدمة تأسيس شركة في دبي فقط بل تصل الخدمة إلى العديد من الإمارات منها الشارقة, وعجمان وأبو ظبي.
`
},
{
  title : "كيفية إنشاء وتأسيس الشركات؟",
  desc : `
  <p>يندرج مصطلح "تأسيس شركة" تحت مفهوم اجتماع شخص أو مجموعة أشخاص بهدف إدارة مبلغ من المال وقدره, فى استثمارِِ بمجالِِ ما تحت إطار قانوني منظّم يساعد في إدارة المشروع؛ حتى ينتج أرباحًا طائلة، وقد حددت القوانين المنظِّمة للشركات شروط تأسيس شركة في مصر وبنود عقد الشراكة, وهي كذلك شروط تأسيس شركة في دبي بالإمارات.
ما يقوم به المحامي المتخصص لدينا في المجموعة التجارية والبحرية للمحاماة من خطوات تأسيس الشركات في مصر ذات الأساس القانوني والإداري القوي هو كالآتي:</p>
<ul>
    <li>
        <strong>تحديد نشاط الشركة:</strong> 
        يتم اختيار النشاط الذي ستزاوله الشركة، سواء كان صناعيًا، تجاريًا، أو إلكترونيًا، وتحديد طبيعة العمل وأساسها الذي سيتم عليه تنفيذ باقي إجراءات التأسيس.
    </li>
    <li>
        <strong>تحديد اسم تجاري:</strong> 
        هنا يهتم المحامي تحت إشراف مكتب تأسيس الشركات باختيار اسم للشركة يتميز بالإثارة والاختلاف، باعتباره إحدى علامات الجذب.
    </li>
    <li>
        <strong>تحديد رأس مال الشركة:</strong> 
        يقوم المحامي بوضع بند رأس مال الشركة فقط على الورق؛ حتى تسمع المصارف والبنوك بتقديم التمويل والقروض.
    </li>
    <li>
        <strong>عقد تأسيس الشركة:</strong> 
        في حال كان القائمون على عملية الشراكة مجموعة وليس فردًا، يتم عمل عقد شراكة لكل منهم، مع وضع بنود وشروط يتم على أساسها تحديد السياسة والنظام الذي ستقوم عليه شركة ناجحة. 
        بالإضافة إلى إلزامهم بعدم مخالفة الشروط؛ لأن ذلك سيمثل تهديدًا لنجاح الشركة.
    </li>
    <li>
        <strong>تسجيل الشركة:</strong> 
        هنا يتجلى دور المحامي وكفاءته في إجراءات تأسيس الشركات وتسجيل عقد الشراكة والشركة في وزارة التجارة والصناعة ومصلحة الضرائب المصرية.
    </li>
</ul>

  `
},
{
  title : "خطوات تأسيس الشركات بأنواعها المختلفة (فردية - مساهمة - ذات مسئولية محدودة)",
  desc : `
  <ul>
  <li><strong>تأسيس شركة فردية</strong> قامت هيئة الاستثمار في مصر بتحديد خطوات تأسيس شركة الشخص الواحد في مصر وهذه الخطوات منها كالآتي:</li>
  <ol>
    <li>
        تقديم صورة إثبات شخصية وصورة أخرى من توكيل تأسيس الشركات حسب الأحوال.
    </li>
    <li>
        تقديم إقرار لصاحب الشركة ينص على أنه غير مشترك في أعمال التوظيف أو أي شركة في القطاع العام أو الخاص.
    </li>
    <li>
        استخراج شهادة عدم التباس اسم الشركة التجاري، والتي يمكن عدم استخراجها في حال لم يطلبها البنك أثناء فتح الحساب البنكي، بالإضافة إلى إيداع كل رؤوس الأموال في البنك التي سوف تستثمرها في إنشاء الشركة.
    </li>
    <li>
        قم باستخراج استمارة تأسيس شركة فردية من خلال زيارة مجمع خدمات الاستثمار المصري.
    </li>
    <li>
        تابع خط سير ملف الشركة من خلال الذهاب إلى هيئة الاستثمار لطلب نموذج متابعة.
    </li>
    <li>
        يبدأ الموظف بإدخال بيانات العقد الابتدائي لتأسيس شركة فردية، بعد أن ينتهي من التأكد من اكتمال الأوراق المطلوبة، ومنها تحصل على أذونات لتسديد تكاليف التأسيس ثم التوجه إلى بنك فرع الاستثمار لتسديد الرسوم.
    </li>
    <li>
        توجه إلى نقابة التجاريين لتسديد تكاليف النقابة، ثم قم بطباعة إيصالات السداد 3 صور وإرسال نسختين منها مع إيصال إذن السداد.
    </li>
    <li>
        وأخيرًا، من خطوات تأسيس الشركات قم باستخراج السجل التجاري ليتم بذلك إنهاء أول خطوة من خطوات تأسيس شركة فردية في مصر.
    </li>
</ol>
<li><strong>تأسيس شركة مساهمة</strong>عند الإقدام على تأسيس شركة مساهمة مع بعض شركاء التأسيس تأكد من عمل الإجراءات القانونية اللازمة حيال إنشاء الشركة بأساس قانوني قوي ومنها:</li>
<ol>
    <li>
        أولاً وقبل أي شيء، يجب على مؤسس الشركة وعلى الشركاء المساهمين تقديم طلب موافقة من الجهة الحكومية التي يعملون بها على إقرار الوظيفة في حال كان أحدهم يعمل كموظف عام أو حكومي.
    </li>
    <li>
        استخراج وتسليم شهادة عدم التباس بالموافقة على نوع الشركة ونشاطها التجاري بالإضافة إلى اسم الشركة، وهي أحد خطوات تأسيس الشركات بشكل مبدئي. وإن تطلب الأمر، قم بتقديم موافقة على نشاط الشركة من الجهات المعنية.
    </li>
    <li>
        كذلك من شروط فتح شركة هي إيداع ما يقارب نسبة 10% في أحد بنوك الاستثمار المصرية من إجمالي رأس مال الشركة عند تحديدها.
    </li>
    <li>
        أثبت إيداع رأس المال هذا، من خلال تقديم مستند يشتمل على الإيداع من قبل شركات القيد المركزي مرفقة بإيصال سداد الرسوم.
    </li>
    <li>
        استخراج شهادة إثبات أن كافة إجراءات الاكتتاب بأسهم وحصص الشركة تم تجهيزها بشكل كلي.
    </li>
    <li>
        كخطوة أخيرة في خطوات تأسيس شركة مساهمة في مصر، قدم نسخة من العقد الابتدائي وعقد نظام الشركة الأساسي.
    </li>
</ol>
<li><strong>تأسيس شركة ذات مسؤولية محدودة
</strong>يتساءل الكثيرون عن كيفية تأسيس شركة ذات مسؤولية محدودة في مصر نظرًا لكونها من أكثر أنواع تأسيس الشركات انتشارًا في مصر والعالم ومن هذه الإجراءات ما يلي:</li>
<ol>
    <li>
        ملء بيانات نموذج العقد الابتدائي وعقد النظام الأساسي كخطوة مبدئية في تأسيس شركة ذات مسؤولية محدودة في مصر (لا يتم تقديم هذا العقد لهيئة الاستثمار وإنما تستعمله كدليل إرشادي أثناء مراجعة عقد إنشاء الشركة).
    </li>
    <li>
        في حال كان للشركة شركاء تأسيس أجانب، يجب عليهم عمل استيفاء لنموذج استعلامات أمنية، ويتم ذلك عن طريق التوجه إلى مكتب الاستعلامات الأمنية في مصر.
    </li>
    <li>
        استخراج شهادة عدم التباس اسم الشركة التجاري، يتم سحبها في حالة طلب البنك ذلك أثناء فتح الحساب البنكي (مدة صلاحية هذه الشهادة أسبوع واحد).
    </li>
    <li>
        فتح حساب بنكي مجمد (أي لا يسمح بإجراء معاملات مصرفية من خلاله)، ثم قم بإيداع كامل رأس مال الشركة به، وتاليًا قم باستخراج السجل التجاري للشركة.
    </li>
    <li>
        توجه إلى هيئة الاستثمار لتقديم طلب استيفاء متابعة خط سير ملف الشركة، ويشمل على أوراق منها ورقة طلب نشر في صحيفة الاستثمار مرفقة بورقة استيفاء المتابعة.
    </li>
    <li>
        بعد انتهاء الموظف من مراجعة الأوراق المطلوبة ضمن إجراءات تأسيس شركة ذات مسؤولية محدودة، يقوم بتسجيل بيانات العقد الابتدائي والنظام الأساسي للشركة، ثم طباعة المستند وطلب توقيع المؤسس عليه.
    </li>
    <li>
        تقوم إدارة المتابعة بعد التأكد من أصل الرقم القومي وأصل التوكيل بتحويل ملف إنشاء الشركة إلى الشهر العقاري، وذلك لتوثيق العقد والنظام الأساسي.
    </li>
    <li>
        وأخيرًا، يتم إصدار قرار التأسيس بعد إتمام كافة شروط فتح شركة ذات مسؤولية محدودة في الشهر العقاري (ذلك خلال 24 ساعة).
    </li>
</ol>

  </ul>
  `
},

{
  title : "ما هي الشروط اللازمة لتأسيس الشركات في مصر والوطن العربي؟",
  desc : `
  <ul>
  يخضع تأسيس الشركات لعدة شروط وأحكام قانونية يجب على كل رجل أعمال أو استثماري مقبل على فتح شركة الالتزام بها، هذه الشروط تختلف بناءً على قانون الشركات القائم في كل دولة، لكن سنقدم تفصيل عام للشروط الشائعة في معظم دول الوطن العربي والتي هي:
  <li>
        <strong>توضيح نشاط ونوع الشركة:</strong> يقوم مؤسس الشركة بشكل مبدئي بتوضيح الهدف الأساسي من إنشاء الشركة ولأي نشاط مستخدم بالإضافة إلى تحديد نوع الشركة من شركة فردية وشركة مساهمة أو شركة ذات مسؤولية محدودة.
    </li>
    <li>
        <strong>الاسم الخاص بالشركة:</strong> يجب على كل شركة التأني في وضع اسم للشركة ويجب أن يكون مميزًا ومختلفًا ومعبرًا بشكل مباشر أو غير مباشر عن نشاط الشركة.
    </li>
    <li>
        <strong>الترخيص والتصريح:</strong> يعد هذا أيضًا من شروط فتح الشركة سواء في دبي بالإمارات (للأجانب) أو في السعودية، وهو ضرورة أن يكون ضمن أوراق عقد تأسيس شركة أوراق الترخيصات والتصريحات الخاصة والأذونات التي تسمح للشركة ببدء نشاطاتها في إطار قانوني.
    </li>
    <li>
        <strong>رأس المال الأدنى:</strong> تحديد رأس المال الذي سيتم استثماره في التأسيس ويختلف ذلك حسب حجم الشركة المراد إنشائها وعمل حساب بنكي مجمد لإيداع به رأس مال الشركة.
    </li>
    <li>
        <strong>التوقيعات والشهود:</strong> من أهم شروط فتح شركة هو أن تتوفر بعض التأكيدات على الإذن بمباشرة تأسيس الشركة، وهي وجود توقيعات أو شهود على إجراءات عمل التأسيس.
    </li>
    <li>
        <strong>العقود والوثائق القانونية:</strong> عقد التأسيس وعقد النظام الأساسي للشركة، أحد أهم شروط تأسيس الشركات في مصر وبعض دول الوطن العربي من الإمارات والسعودية، والتي منها عقد توثيق الشركة أو عقود الشركاء المساهمين (إذا كانت الشركة مساهمة)، وعقد التوظيف أو أي عمل حكومي أو في القطاع العام لموافقة هيئة الاستثمار على استكمال إجراءات التأسيس.
    </li>
    
  </ul>
  <p>تمت الإجابة عن هذا السؤال بطريقة عامة للشروط والأكثر اعتمادًا في الوطن العربي، لكن من المحتمل اختلاف الشروط من دولة لأخرى، لذا يجب وقبل مباشرة اجراءات تأسيس الشركات بكافة؛ لاطلاع على شروط التأسيس حسب دولة كل مستثمر أو رجل أعمال، ويتم ذلك من خلال استشارة مكتب تأسيس شركات كمجموعة TCMG للمحاماة.</p>
  `
},
{
  title : "ما أهمية توكيل محامي متخصص في تأسيس الشركات والشئون القانونية؟",
  desc : `
  <ul>
  دائمًا ما تقوم إدارة الشركات على العلم والمعرفة الإدارية، مما يجعل من الاستعانة بالمختصين بالمجالات المهنية أمر بالغ الأهمية؛ فعلى سبيل المثال لا تستغني المنشأة بأي حال من الأحوال عن أعمال المحاسبة لأنها ضرورة لأي مؤسسة تسعى للنمو في بيئة عمل تنافسية, وذلك يرجع إلى كونها أساس لتنظيم الموارد المالية للشركات.
إذََا فإن الإجراءات القانونية لا يمكن أن تقل أهمية عن المحاسبية, وهذه الإجراءات يقوم بها محامي تأسيس شركات من المجموعة التجارية والبحرية للمحاماة أحد أكثر المحامين المَهرَة في مجال تأسيس الشركات في مصر والإمارات. من هذه الإجراءات:
  <li>صياغة السياسات والإجراءات في المنشأة.</li>
    <li>تحديد المسؤوليات وفق الوصف الوظيفي للموظفين.</li>
    <li>صياغة ومراجعة العقود بشتى أنواعها (عقود إيجار - عقود توظيف - عقود تجارة... إلخ).</li>
    <li>تنظيم علاقات الموظفين من حقوق وواجبات.</li>
    <li>حماية الملكية الفكرية والعلامات التجارية والمنتجات.</li>
    <li>التأكد من تطابق الشركة والمؤسسة مع الأنظمة المرعية والمعمول بها.</li>
    <li>تقديم المشورة القانونية للرئيس التنفيذي ومجلس الإدارة.</li>
  </ul>
  <p>وهناك الكثير من الأوضاع والأمور التي تتطلب توكيل محامي من مكتب تأسيس شركات تأسيس شركات على دراية بمختلف القوانين واللوائح والأنظمة لتوفير التأمين والحماية وتقديم التوجيه والإرشاد القانوني. فالدوار الأهم للمحامي يتركز في المراحل الأولى بالأداء العملي وليس من ساحات القضاء. كما تبرز أهمية المحامي المختص لدينا في التعاقدات التي تجريها الشركة، فهو يقوم بصياغة عقد تأسيس شركة في مصر ومراجعتها بشكل عميق, كما يختص بتقديم خدمة تأسيس شركة في الامارات حيث يقوم كذلك بكتابة العقود والتحقق والتدقيق في البنود الواردة فيها بالفسخ والتعويضات لما تمثله من أهمية شديدة خاصة إذا ما انتقل النزاع إلى القضاء؛ لأن هناك شركات خسرت أعمالها بسبب عقد تجارى واحد فدائمًا المحامى يتخذ الحيطة والحذر عند مراجعة وتحليل البنود الواردة في أي عقد قبل اتخاذ أي إجراء, وبذلك يقطع السبيل عن أي إقدام من الطرف الآخر للولوج فى نزاع قضائى و حسمه لصالح شركته منذ البداية.
</p>
  `
}
];

const Accordion = () => {
  return (
    <section className={`accordionQuestions`}>
      <h2 >أسئلة عملائنا حول خدمة تأسيس الشركات</h2>
      {data.map((el, index) => (
        <AccordionCard title={el.title} desc={el.desc} key={index} />
      ))}
    </section>
  );
};

export default Accordion;
