"use client";

import AccordionCard from "@/components/shared/client/accordionCard/AccordionCard";

const data = [
  {
    title: "هل نقدم خدمة تأسيس الشركات بالهيئة العامة للاستثمار؟",
    desc: "نعم, حيث تسعى المجموعة التجارية والبحرية للمحاماة إلى توفير مجموعة واسعة من الخدمات والتي منها خدمة تأسيس الشركات بالهيئة العامة للاستثمار والتي يشرف على تقديمها بصورة مميزة مبتكرة محامي تأسيس شركات في مصر على درجة عالية من الخبرة في مسائل تأسيس الشركات فهي نقطة انطلاقة كبيرة لبناء كيان اقتصادي ناجح في إدارة المشروعات الاستثمارية من خلال البوابة الإلكترونية للهيئة العامة للاستثمار المستندة على قانون الاستثمار الذي ينص على توفير سبل للضمان والحماية لحفظ حقوق المستثمرين, بالإضافة إلى قانون الشركات فهو أحد الأنظمة لبيئة الاستثمار والتجارة. يتولى المحامي تحديد رسوم تأسيس الشركات بالهيئة العامة للاستثمار بناءً على الاتعاب والخدمات التي قدمها غير خدمة تأسيس شركة في القاهرة (مصر) أو خدمة تأسيس شركة في دبي (الإمارات) والتي هي خدمة أعمال الشركات.",
  },
  {
    title: "ما أنواع الشركات التي نقدم خدمة تأسيس الشركات بها؟",
    desc: `يمثل تحديد النشاط التجاري الذي ستمارسه الشركة الناشئة أول درجات عملية التأسيس لأن عليه سيتم تحديد باقي عناصر الإنشاء؛ فلا تنهض أي شركة أو مؤسسة دون تحديد طبيعة العمل. سنعرض لك بعض أنواع الشركات:
تأسيس شركة فردية: والتي تسمى أيضاً بشركة الشخص الواحد وهي أحد مشاريع الاستثمار الصغيرة التي يقوم عليها رجل أعمال واحد بدعم مالي بسيط مقارنة بالشركات المتوسطة والكبيرة, وهو نوع التجارة الذي يقوم عليه فرد واحد ترجع إليه كل العوائد المادية, كما تقع على كل الشئون الإدارية والمالية، سواء أكان رائد الأعمال يهدف لتأسيس شركة إلكترونية أو عادية.
تأسيس شركة مساهمة:  تقوم شركات المساهمة على مجموعة من المساهمين باستثمار أسهمهم في تلك الشركة ويكون لكل منهم شهادة تثبت أحقيته في امتلاك أسهم في الشركة, ولا يتم تحديد المساهمين على شركاء التأسيس فقط بل يمكن لأي صاحب أسهم ورؤوس المال أن يساهم في هذا المشروع.
تأسيس شركة ذات مسئولية محدودة: يعد نوع الشركات ذات المسؤولية المحدودة النوع الأكثر أنواع الشركات انتشارًا في العالم لما له من سياسة تطبيق خاصة, تتيح انضمام العديد من رجال الأعمال أو الشركات أو كلاهما معًا كل حسب اختصاصه وسلطته وحسابه من رأس المال الذي قام بمشاركته في تأسيس الشركة, ويتم تحديد نظام وسياسة التأسيس بناءً على قانون تأسيس الشركات في كل دولة.
هل لديك أي استفسارات ترغب في معرفتها؟ اضغط على الرابط التالي للتوجه لصفحة اسأل محامي التي ستمكنك من كتابة كل أسألتك والحصول على الإجابات الوافية من خبراء المجموعة التجارية والبحرية للمحاماة.
`,
  },
  {
    title: "كم تكلفة توكيل محامي ؟",
    desc: `إن تكلفة عمل توكيل محامي للنظر في قضية أو إثبات أحقية الممتلكات خاصة في القضايا العقارية أو أيًا كانت الخدمة المطلوبة؛ فمن المتعارف عليه أن عمل التوكيل عملية مكلفة وذلك يرجع إلى الخبرات والاحترافية التي يتسم بها المحامي وبناءً على المجهود والمدة التي استهلكها في حل القضية يتم تحديد الكلفة وقدرها, كما يتم تحديد رسوم التوكيل حسب نوع وسبب  هذا التوكيل ولأي جهة سيتم إرساله.
سعر توكيل المحامي في الشهر العقاري: إن سعر التوكيل بمصلحة الشهر العقاري تُقدَّر برسوم معينة ويتم تحديد هذه الرسوم من مصلحة الشهر العقاري فقط
سعر توكيل عام وخاص قضايا 2024: يتم تسعير التوكيل العام للقضية الواحدة بناء على عدد الأفراد ومختلف المهن حيث:
الحالة الأولى: إذا كان فردًا واحدًا فسعر التوكيل 31 جنيهًا.
الحالة الثانية: إذا كان الطرف الآخر مختلف المهن فسعر التوكيل العام هو 46 جنيهًا.
الحالة الثالثة: إذا كان التوكيل لفردين فيكون السعر 56 جنيهًا.
الحالة الرابعة: إذا كان التوكيل لثلاثة أفراد فيكون سعر التوكيل العام 61 جنيهًا.
الحالة الخامسة: إذا كان الطرف الآخر مختلف المهن فسعر التوكيل العام هو 81 جنيه.
إذًا يمكن الإقرار أن متوسط سعر توكيل عام قضايا يتراوح بين 30 : 100 جنيهًا.
تسهيلاً على عملائنا الكرام يمكنك الدخول علي الموقع الرسمي لوزارة العدل لمعرفة رسوم توكيل محامي وأخر التحديثات للرسوم الحقيقة والإجراءات اللازمة لعمل توكيل محامي في الشهر العقاري.
`,
  },
  {
    title : "كيفية إنشاء وتأسيس الشركات؟",
    desc : `يندرج مصطلح "تأسيس شركة" تحت مفهوم لاجتماع شخص أو مجموعة أشخاص بهدف إدارة مبلغ من المال وقدره, فى استثمارِِ بمجالِِ ما تحت إطار قانوني منظّم يساعد في إدارة المشروع؛ حتى ينتج أرباحًا طائلة، وقد حددت القوانين المنظِّمة للشركات شروط تأسيس شركة في مصر وبنود عقد الشراكة, وهي كذلك شروط تأسيس شركة في دبي بالامارات.
ما يقوم به المحامي المتخصص لدينا في المجموعة التجارية والبحرية للمحاماة من خطوات تأسيس الشركات الناجحة ذات أساس قانوني وإداري قوي هو كالآتي:
تحديد نشاط الشركة: يتم اختيار النشاط الذي ستزاوله الشركة سواء كان صناعيًا, تجاريًا, إلكترونيًا, وتحديد طبيعة العمل وأساسها الذي سيتم عليه تنفيذ باقي إجراءات التأسيس.
تحديد اسم تجارى: هنا يهتم محامي تأسيس الشركات باختيار اسم للشركة يتميز بالإثارة والاختلاف والتميز باعتباره إحدى علامات الجذب.
تحديد رأس مال الشركة: يقوم المحامي بوضع بند رأس مال الشركة فقط على الورق؛ حتى تسمع المصارف والبنوك بتقديم التمويل والقروض.
عقد تأسيس الشركة: في حال كانوا القائمين على عملية الشراكة مجموعة وليس فردًا؛ يتم عمل عقد شراكة لكل منهم, مع وضع بنود وشروط يتم على أساسها تحديد السياسة والنظام الذي ستقوم عليه شركة ناجحة, بالإضافة إلى إلزامهم بعدم مخالفة الشروط؛ لأن ذلك سيمثل تهديدًا لنجاح الشركة.
تسجيل الشركة: هنا يتجلى دور المحامي وكفاءته في اجراءات تأسيس الشركات وتسجيل عقد الشراكة والشركة في وزارة التجارة والصناعة ومصلحة الضرائب المصرية.`
  },
  {
   title : "خطوات تأسيس الشركات بأنواعها المختلفة (فردية - مساهمة - ذات مسئولية محدودة)",
    desc : `تأسيس شركة فردية
قامت هيئة الاستثمار في مصر بتحديد طريقة تأسيس شركة الشخص الواحد في مصر وهذه الخطوات منها كالآتي:
تقديم صورة إثبات شخصية وصورة أخرى من توكيل تأسيس الشركات حسب الأحوال.
تقديم إقرار لصاحب الشركة ينص على أنه غير مشترك في أعمال التوظيف أو أي شركة في القطاع العام أو الخاص.
استخراج شهادة عدم التباس اسم الشركة التجاري كذلك من إجراءات تأسيس الشركات، والتي يمكن عدم استخراجها في حال لم يطلبها البنك أثناء فتح الحساب البنكي، بالإضافة إلى إيداع كل رؤوس الأموال في البنك التي سوف تستثمرها في إنشاء الشركة.
قم باستخراج استمارة تأسيس شركة فردية من خلال زيارة مجمع خدمات الاستثمار المصري.
تابع خط سير ملف الشركة من خلال الذهاب إلى هيئة الاستثمار لطلب نموذج متابعة.
يبدأ الموظف بإدخال بيانات العقد الابتدائي لتأسيس شركة فردية، بعد أن ينتهي من التأكد من اكتمال الأوراق المطلوبة، ومنها تحصل على أذونات لتسديد تكاليف التأسيس ثم التوجه إلى بنك فرع الاستثمار لتسديد الرسوم.
توجه إلى نقابة التجاريين لتسديد تكاليف النقابة، ثم قم بطابعة إيصالات السداد 3 صور وإرسال نسختين منها مع إيصال إذن السداد.
وأخيرًا قم باستخراج السجل التجاري ليتم بذلك إنهاء أول خطوة من خطوات تأسيس شركة فردية في مصر.

 

تأسيس شركة مساهمة
عند الإقدام على تأسيس شركة مساهمة مع بعض شركاء التأسيس تأكد من عمل الإجراءات القانونية اللازمة حيال إنشاء الشركة بأساس قانوني قوي ومنها:
أولاً وقبل أي شيء, يجب على مؤسس الشركة وعلى الشركاء المساهمين تقديم طلب موافقة من الجهة الحكومية التي يعملون بها على إقرار الوظيفة في حال كان أحدهم يعمل كموظف عام أو حكومي.
استخراج وتسليم شهادة عدم التباس بالموافقة على نوع الشركة ونشاطها التجاري بالإضافة إلى اسم الشركة، وهي أحد خطوات تأسيس شركة بشكل مبدئي، وإن تطلب الأمر طلب الجهات المعنية؛ قم بتقديم موافقة على نشاط الشركة.
كذلك من شروط فتح شركة هي إيداع ما يقارب نسبة 10% في أحد بنوك الاستثمار المصرية من إجمال رأس مال الشركة عند تحديدها.
أثبت إيداع رأس المال هذا، من خلال تقديم مستند يشمل الإيداع من قبل شركات القيد المركزي مرفقة بإيصال سداد الرسوم.
استخراج شهادة إثبات أن كافة إجراءات الاكتتاب بأسهم وحصص الشركة تم تجهيزها بشكل كلي.
كخطوة أخيرة في خطوات تأسيس شركة مساهمة في مصر، قدم نسخة من العقد الابتدائي وعقد نظام الشركة الأساسي.

 

تأسيس شركة ذات مسؤولية محدودة
يتساءل الكثيرون عن كيفية تأسيس شركة ذات مسؤولية محدودة في مصر نظرًا لكونها من أكثر أنواع الشركات انتشارًا في مصر والعالم ومن هذه الإجراءات ما يلي:
ملئ بيانات نموذج العقد الابتدائي وعقد النظام الأساسي كخطوة مبدئية في تأسيس شركة ذات مسؤولية محدودة في مصر (لا يتم تقديم هذا العقد لهيئة الاستثمار وإنما تستعمله كدليل إرشادي أثناء مراجعة عقد إنشاء الشركة).
في حال كان للشركة شركاء تأسيس أجانب، يجب عليهم عمل استيفاء لنموذج استعلامات أمنية ويتم ذلك عن طريق التوجه إلى مكتب الاستعلامات الأمنية في مصر.
استخراج شهادة عدم التباس اسم الشركة التجاري، يتم سحبها في حالة طلب البنك ذلك أثناء فتح الحساب البنكي (مدة صلاحية هذه الشهادة أسبوع واحد).
فتح حساب بنكي مجمد (أي لا يسمح بإجراء معاملات مصرفية من خلاله)، ثم قم بإيداع كامل رأس مال الشركة به ، وتاليًا قم باستخراج السجل التجاري للشركة.
توجه إلى هيئة الاستثمار تقدم بطلب استيفاء متابعة خط سير ملف الشركة، ويشمل على أوراق منها, ورقة طلب نشر في صحيفة الاستثمار مرفقة بورقة استيفاء المتابعة.
بعد انتهاء الموظف من مراجعة الأوراق المطلوبة ضمن إجراءات تأسيس شركة ذات مسئولية محدودة، يقوم بتسجيل بيانات العقد الابتدائي والنظام الأساسي للشركة، ثم طبع المستند وطلب توقيع المؤسس عليه.
تقوم إدارة المتابعة بعد التأكد من أصل الرقم القومي وأصل التوكيل بتحويل ملف إنشاء الشركة إلى الشهر العقاري، وذلك لتوثيق العقد والنظام الأساسي.
وأخيرًا يتم إصدار قرار التأسيس بعد إتمام كافة شروط فتح شركة ذات مسؤولية محدودة في الشهر العقاري (ذلك خلال 24 ساعة).`
  },
  {
    title : "ما هي الشروط اللازمة لتأسيس الشركات في مصر والوطن العربي؟",
    desc : `يخضع تأسيس الشركات لعدة شروط وأحكام قانونية يجب على كل رجل أعمال أو استثماري مقبل على فتح شركة الالتزام بها، هذه الشروط تختلف بناءً على قانون الشركات المعمول به في كل دولة، لكن سنقدم تفصيل عام للشروط الشائعة في معظم دول الوطن العربي والتي هي:
توضيح نشاط ونوع الشركة: يقوم مؤسس الشركة بشكل مبدئي بتوضيح الهدف الأساسي من إنشاء الشركة ولأي نشاط ستخدم بالإضافة إلى تحديد نوع الشركة من شركة فردية وشركة مساهمة أو شركة ذات مسؤولية محدودة.
الاسم الخاص بالشركة: يجب على كل شركة التأني في وضع اسم للشركة ويجب أن يكون مميزًا ومختلفًا ومعبرًا بشكل مباشر أو غير مباشر عن نشاط الشركة.
الترخيص والتصريح: يعد هذا أيضًا من شروط فتح الشركة سواء في دبي بالإمارات (للأجانب) أو في السعودية، وهو ضرورة أن يكون ضمن أوراق عقد تأسيس شركة أوراق الترخيصات والتصريحات الخاصة والأذونات التي تسمح للشركة ببدء نشاطاتها في إطار قانوني.
رأس المال الأدنى: تحديد رأس المال الذي سيتم استثماره في التأسيس ويختلف ذلك حسب حجم الشركة المراد إنشائها وعمل حساب بنكي مجمد لإيداع به رأس مال الشركة.
التوقيعات والشهود: من أهم شروط فتح شركة هو أن تتوفر بعض التأكيدات على الإذن بمباشرة تأسيس الشركة, وهي وجود توقيعات أو شهود على إجراءات عمل التأسيس.
العقود والوثائق القانونية: عقد التأسيس وعقد النظام الأساسي للشركة، أحد أهم الشروط العامة لتأسيس الشركات في مصر وبعض دول الوطن العربي من الإمارات والسعودية في تأسيس الشركات، والتي منها عقد توثيق الشركة أو عقود الشركاء المساهمين (إذا كانت الشركة مساهمة)، وعقد التوظيف أو أي عمل حكومي أو في القطاع العام لموافقة هيئة الاستثمار على استكمال إجراءات التأسيس.
تمت الإجابة عن هذا السؤال بطريقة عامة للشروط والأكثر اعتمادًا في الوطن العربي، لكن من المحتمل اختلاف الشروط من دولة لأخرى، لذا يجب وقبل مباشرة إجراءات تأسيس الشركات بكافة أنواعها من تأسيس شركة فردية أو مساهمة أو شركة ذات مسؤولية محدودة، الاطلاع على شروط التأسيس حسب دولة كل مستثمر أو رجل أعمال، ويتم ذلك من خلال استشارة محامي شركات أو مستشار قانوني تابع للمجموعة التجارية والبحرية للمحاماة والاستشارات القانونية للحصول على كافة المعلومات والمساعدات في تأسيس شركة ناجحة قانونيًا.`
  },
  {
    title : "ما أهمية توكيل محامي متخصص في تأسيس الشركات والشئون القانونية؟",
    desc : `دائمًا ما تقوم إدارة الشركات على العلم والمعرفة الإدارية، مما يجعل من الاستعانة بالمختصين بالمجالات المهنية أمر بالغ الأهمية؛ فعلى سبيل المثال لا تستغني المنشأة بأي حال من الأحوال عن أعمال المحاسبة لأنها ضرورة لأي مؤسسة تسعى للنمو في بيئة عمل تنافسية, وذلك يرجع إلى كونها أساس لتنظيم الموارد المالية للشركات. إذََا فإن الإجراءات القانونية لا يمكن أن تقل أهمية عن المحاسبية, وهذه الإجراءات يقوم بها محامي تأسيس شركات من المجموعة التجارية والبحرية للمحاماة أحد أكثر المحامين المَهرَة في مجال تأسيس الشركات في مصر والإمارات. من هذه الإجراءات:
صياغة السياسات والإجراءات في المنشأة.
تحديد المسئوليات وفق الوصف الوظيفي للموظفين.
صياغة ومراجعة العقود بشتى أنواعها (عقود إيجار - عقود توظيف - عقود تجارة... إلخ).
تنظيم علاقات الموظفين من حقوق وواجبات.
حماية الملكية الفكرية والعلامات التجارية والمنتجات.
التأكد من تطابق الشركة والمؤسسة مع الأنظمة المرعية والمعمول بها.
تقديم المشورة القانونية للرئيس التنفيذي ومجلس الإدارة.
وهناك الكثير من الأوضاع والأمور التي تتطلب توكيل محامي تأسيس شركات على دراية بمختلف القوانين واللوائح والأنظمة لتوفير التأمين والحماية وتقديم التوجيه والإرشاد القانوني. فالدوار الأهم للمحامي يتركز في المراحل الأولى بالأداء العملي وليس من ساحات القضاء لأن في تلك الحالة وإن كان مقر تأسيس الشركات خارج مصر وحدث نزاعات بين الشركة وشركة أخرى يتم توكيل لهذه القضية محامي دولي؛ فليس من تخصصات محامي تأسيس الشركات حل النزاعات بل تجنب حدوثها كحل مبدئي؛ فهو يتعامل مع مختلف قطاعات الشركة وإدارتها.
كما تبرز أهمية المحامي المختص لدينا في التعاقدات التي تجريها الشركة، فهو يقوم بصياغة عقد تأسيس شركة في مصر ومراجعتها بشكل عميق, كما يختص بتقديم خدمة تأسيس شركة في الامارات حيث يقوم كذلك بكتابة العقود والتحقق والتدقيق في البنود الواردة فيها بالفسخ والتعويضات لما تمثله من أهمية شديدة خاصة إذا ما انتقل النزاع إلى القضاء؛ لأن هناك شركات خسرت أعمالها بسبب عقد تجارى واحد فدائمًا المحامى يتخذ الحيطة والحذر عند مراجعة وتحليل البنود الواردة فى أي عقد قبل اتخاذ أي إجراء, وبذلك يقطع السبيل عن أي إقدام من الطرف الآخر للولوج فى نزاع قضائى و حسمه لصالح شركته منذ البداية.`
  }
];

const Accordion = () => {
  return (
    <section className="accordionQuestions">
      <h2>أسئلة عملائنا حول خدمة تأسيس الشركات</h2>
      {data.map((el, index) => (
        <AccordionCard title={el.title} desc={el.desc} key={index} />
      ))}
    </section>
  );
};

export default Accordion;
