import styles from "./page.module.css";
import HomeHero from "@/components/home/homeHero/HomeHero";
import HomeCarousel from "@/components/home/client/homeCarousel/HomeCarousel";
import HomeWhyUs from "@/components/home/homeWhyUs/HomeWhyUs";
import Stats from "@/components/shared/stats/Stats";
import HomeScroll from "@/components/home/client/homeScroll/HomeScroll";
import HomeArticleScroll from "@/components/home/client/homeScroll/HomeArticleScroll";
import HomeTeam from "@/components/home/client/homeTeam/HomeTeam";
import Parteners from "@/components/home/client/partener/Parteners";
import Branches from "@/components/home/client/branches/Branches";
import Head from "next/head";

const services = [
  {
    id: 1,
    img: "/assets/images/homePage/تأسيس الشركات.png",
    header: "تأسيس الشركات",
    alt: "مكتب قانوني لتأسيس شركات في مصر",
    body: "هل تبحث عن مكتب متخصص في تأسيس الشركات؟ نعمل على تقديم الدعم الكامل لأعمال الشركات المختلفة بمستوى مميز من الأداء, حيث نقدم الدعم في تأسيس الشركات بمختلف أنواعها في مصر، السعودية والإمارات وأيضًا إعداد عقود التأسيس واللوائح الداخلة والجمعية العمومية. يمتد دورنا كمكتب محاماة واستشارات قانونية في مساعدتك على اختيار نوع الشركة، وتوفير الدعم في كافة مراحل التأسيس والإعداد.",
    ref: "establishing-companies",
  },
  {
    id: 2,
    img: "/assets/images/homePage/الاستشارات القانونية.png",
    header: "الاستشارات القانونية",
    alt: "مكتب محاماة واستشارات قانونية في مصر",
    body: "نسعى دائما لاحتلال الصدارة كشركة للمحاماة والاستشارات القانونية، لذا نقدم النصائح القانونية مدعومة من كبار المستشارين في مصر المتخصصين في مختلف مجالات القانون. نحن على استعداد تام لتقديم المشورة والآراء القانونية في مختلف الشؤون والمسائل القانونية الخاصة بالأفراد والشركات، وتقديم أفضل الحلول الموثوقة لقضاياهم القانونية.",
    ref: "legal-advice",
  },
  {
    id: 3,
    img: "/assets/images/homePage/توكيل محامي .png",
    header: "توكيل محامي",
    alt: "توكيل محامي من مكتب محاماة دولي",
    body: "هل تبحث عن مكتب محاماة دولى فى مصر لحل جميع مسائلك القانونية؟ قم الآن بتوكيل محامي من خبراء TCMG يتمتع بكفاءة عالية وخبرة كافية في شتى فروع القانون, بما يلزم لتمثيلك قانونيًا وتقديم دعم قانوني قوي بالإضافة لإتمام كافة الإجراءات القانونية نيابة عنك, سواء كنتَ فردًا أو شركةً.",
    ref: "power-of-attorney",
  },
  {
    id: 3,
    img: "/assets/images/homePage/اعمال الشركات.png",
    header: "أعمال الشركات",
    alt: "اعمال الشركات في مصر",
    body: "هل ترغب في تطوير أعمالك في ظل المنافسة الشديدة؟ ، نحن نقدم الدعم الكامل لرجال الأعمال من خلال خدمات قانونية متكاملة. نساعدك في توسيع نطاق عملياتك، سواء عبر الاندماج والاستحواذ أو التحكيم التجاري، مع تقديم استشارات قانونية مخصصة تلبي احتياجاتك. نحن هنا لنكون شريكك الاستراتيجي و تحقيق النجاح المستدام لشركتك.",
    ref: "corporate",
  },
];

const cases = [
  {
    id: 1,
    img: "/assets/images/homePage/اسواقالمال.png",
    header: "أسواق المال ",
    alt: "شركة محاماة خبيرة في أسواق المال",
    body: "تقوم مكاتب TCMG للمحاماة الدولية بدور مهم في أسواق المال من خلال تقديم الاستشارات القانونية المتخصصة في القضايا المالية والمصرفية. كما نعمل على ضمان الامتثال الكامل للوائح المالية, وتمثيل عملائنا أمام الهيئات التنظيمية والمحاكم المالية؛ مما يساهم في حماية حقوقهم وتعزيز استثماراتهم بأعلى معايير الأمان والشفافية.",
  },
  {
    id: 2,
    img: "/assets/images/homePage/الاندماج.png",
    header: "الإندماج والإستحواذ",
    alt: " خدمة الدمج والاستحواذ القانونية",
    body: "نقوم في مكتب محاماة TCMG بدور فعًّال للشركات في عمليات الاندماج والاستحواذ, حيث نعمل على ضمان الامتثال الكامل للقوانين واللوائح المحلية والدولية, ونسعى لتحقيق أهداف عملائنا الاستراتيجية بكفاءة عالية. كشركة محاماة دولية, نمثل أيضًا عملائنا في التفاوض وإبرام العقود؛ مما يساعدهم في تحقيق نمو مستدام وتوسيع نطاق أعمالهم بطريقة منظمة وفعًّالة.",
  },
  {
    id: 3,
    img: "/assets/images/homePage/بنكية.png",
    header: "الخدمات البنكية والمالية",
    alt: "مكاتب محاماة مالية",
    body: "إذا كنت تبحث عن مكتب محاماة واستشارات قانونية في القطاعين البنكي والمالي؟ نساعد كلًا من للشركات والمؤسسات في هذا المجال عن طريق ضمان الامتثال الكامل للوائح المالية والمصرفية وتمثيلهم أمام الهيئات التنظيمية والمحاكم المختصة. نسعى إلى تقديم حلول قانونية مبتكرة تدعم النمو المالي وتعزز الثقة والاستقرار في استثمارات عملائنا.",
  },
  {
    id: 4,
    img: "/assets/images/homePage/تطوير عقاري.png",
    header: "التطوير العقاري والإنشاءات",
    alt: "إكمال الإجراءات القانونية للتطوير العقاري",
    body: "نعمل جنبًا إلى جنب مع مطوري المشاريع العقارية والمقاولين لضمان الامتثال الكامل للإطار القانوني المنظم لهذا المجال. محامين العقارات بمكاتب TCMG يمتلكون خبرة واسعة في إعداد ومراجعة العقود، وحل النزاعات المتعلقة بالمشاريع العقارية، وإدارة القضايا المتعلقة بالتخطيط والتصاريح. نحرص على تقديم حلول قانونية متكاملة تدعم نجاح المشاريع العقارية وتسهم في حماية حقوق عملائنا في كل مرحلة من مراحل التطوير والبناء.",
  },
  {
    id: 5,
    img: "/assets/images/homePage/تحكيم تجاري.png",
    header: "التحكيم التجاري",
    alt: "مكتب تحكيم تجاري معتمدة",
    body: "هل تواجه نزاعات تجارية وتحتاج إلى حل سريع وفعال؟ في شركة محاماة TCMG, سنعمل على تقديم استشارات قانونية متخصصة للشركات, وتمثيلهم أمام هيئات التحكيم التجارية المحلية والدولية. سيدعم المحامي الدولي حماية حقوقك التجارية والحصول على حلول سريعة وعادلة بما يتوافق مع المعايير القانونية العالمية.",
  },
  {
    id: 6,
    img: "/assets/images/homePage/نقل وشحن.png",
    header: "النقل والشحن",
    alt: "خدمات نقل وشحن موثوقة",
    body: "يقدم مكاتب محاماة TCMG, دعمًا قانونيًا شاملاً لكل الشركات العاملة في قطاع النقل والشحن البحري أو حتى البري. سنعمل خلال مكاتبنا للمحاماة على إتمام عقود النقل, حل النزاعات المتعلقة بالشحن وأيضًا تقديم استشارات قانونية متخصصة؛ لضمان الامتثال للقوانين الدولية وحتى المحلية.",
  },
  {
    id: 7,
    img: "/assets/images/homePage/التقاضي.png",
    header: "التقاضي",
    alt: "مكتب محاماة دولى فى مصر للتقاضي",
    body: "تقدم المجموعة التجارية والبحرية للمحاماة خبرات متعمقة للأفراد والشركات في تقديم الدعم القانوني أمام المحاكم المختلفة. نسعى دائمًا لأن نكون أقوى شركة محاماة دولية في مصر والوطن العربي, لذا نعمل على تحليل القضايا بدقة, إعداد مرافعات قوية بالإضافة إلى تقديم حجج قانونية مدعومة بأدلة قوية.",
  },
];



const articles = [
  {
    id: 1,
    header: "محامي في مصر",
    date: "28 يناير   . 9 دقائق",
    body: "على مر السنين وقد تم الاعتراف بالمحامي المصري كونه أحد أجدر رجال القانون في تولي المسائل القانونية, فقد عُرِف بعقليته الاستراتيجية العالية وامتلاكه المقدرة الفائقة في إدارة الأزمات وفض المنازعات المحلية والدولية في كثير من بلاد الوطن العربي في شتى فروع القانون.",
    img: "/assets/images/homePage/articles/محامي في مصر.png",
  },
  {
    id: 2,
    header: "تأسيس شركة في السعودية",
    date: "28 يناير   . 9 دقائق",
    body: "هي خطوة جوهرية للعديد من رواد الأعمال والمستثمرين الراغبين في استغلال الفرص الاقتصادية المتاحة في البلاد، حيث تعد المملكة العربية السعودية واحدة من أكبر الاقتصادات في الشرق الأوسط وتتمتع ببيئة استثمارية مشجعة ومتطورة.",
    img: "/assets/images/homePage/articles/تأسيس شركة في السعودية.png",
  },
  {
    id: 3,
    header: "تأسيس شركة في السعودية",
    date: "28 يناير   . 9 دقائق",
    body: "هي خطوة جوهرية للعديد من رواد الأعمال والمستثمرين الراغبين في استغلال الفرص الاقتصادية المتاحة في البلاد، حيث تعد المملكة العربية السعودية واحدة من أكبر الاقتصادات في الشرق الأوسط وتتمتع ببيئة استثمارية مشجعة ومتطورة.",
    img: "/assets/images/homePage/articles/تأسيس شركة في السعودية2.png",
  },
  {
    id: 4,
    header: "حماية الملكية الفكرية",
    date: "28 يناير   . 9 دقائق",
    body: "تعد أحد أفرع الملكية حيث لا تقتصر على كونها ملكية مادية فقط خاصة بالعقارات، ويندرج تحتها براءات الاختراع وحقوق النشر والعلامات التجارية؛ لذا وقد باتت الحاجة تتطلب توكيل المحامي المختص بحماية الملكية الفكرية.",
    img: "/assets/images/homePage/articles/حماية الملكية الفكرية.png",
  },
];

export const metadata = {
  title: "الصفحة الرئيسية",
  description:
    "هل تبحث عن شركة محاماة دولية في مصر؟ اتصل الآن بمكتب محاماة TCMG، واحصل على دعم قانوني متميز لجميع الاحتياجات القانونية، في كلا الصعيدين المحلي والدولي.",
  keywords:
    "مكتب محاماة دولي في مصر، شركة محاماة في مصر، مكتب محاماة واستشارات قانونية",
  robots: "index, follow",
  revisit: "2 days",
};

function Home() {
  return (
    <>
      <Head>
        <script
          type="application/ld+json"
          dangerouslySetInnerHTML={{
            __html: JSON.stringify({
              "@context": "https://schema.org",
              "@type": "Organization",
              name: "TCMG",
              url: "https://www.tcmglaw.com",
              contactPoint: [
                {
                  "@type": "ContactPoint",
                  // telephone: "",
                  contactType: "customer service",
                  areaServed: "SA",
                  availableLanguage: "Arabic",
                },
              ],
            }),
          }}
        />
      </Head>
      <div className={styles.page}>
        <HomeHero />
        <HomeCarousel />
        <HomeWhyUs />
        <HomeScroll cases={cases} services={services} />
        <HomeTeam />
        <Stats />
        <Parteners />
    
        <HomeArticleScroll articles={articles} />
        <Branches />
      </div>
    </>
  );
}

export default Home;
