"use client";
import AccordionCard from "@/components/shared/client/accordionCard/AccordionCard";

const data = [
  {
    title: "وظائف محامين متاحة في المجموعة التجارية والبحرية للمحاماة",
    desc: `
    
    <p>نفتخر في المجموعة التجارية والبحرية للمحاماة بإتاحة فرص مهنية تشمل وظائف خالية للمحامين بالشركات, لمَن يتملّكُه حب البحث عن تحديات جديدة وفرص وظائف محامين مميزة, تقدم كل الدعم للمقبلين على طلبات وظائف المحاماه؛ لتغطية جميع فروع القانون المتنوعة.من الوظائف المتاحة في مكاتبنا: </p>
    <ul>
    <li><strong>وظائف خالية محامين ابتدائي:</strong>تاليًا وظائف محامين ابتدائي، يعد هذا القسم من وظائف المحاماة, الخطوة الأولى التي يتخذها كل شابٍ مقبلٍ على اقتناص فرصة النمو والتطور والوصول إلى مستويات عليا من إتقان المهارات المهنية, والتعمق في معرفة فروع القانون المختلفة. يتطلب من كل محامي ابتدائي الاستجابة للطلبات الابتدائية منها على سبيل المثال, تقديم الاستشارات القانونية بما تسلّح به من معرفة شاملة عن ثنايا القانون.</li>
    <li><strong>وظائف خالية محامين استئناف:</strong>إبتداءً من وظائف محامين استئناف؛ تشكل فرصة التوظيف هذه خيارًا أمثل لكل من يمتاز بامتلاكه مهارات التدقيق والتحليل الفريدة, ومَن يمتلك فكر استراتيجي ذكي في حل القضايا الصعبة. في مجموعتنا نوفر وظائف خالية محامين استئناف, هذه الوظيفة التي تتطلب امتلاك المُتقدِّم عليها قوة الدفاع وتمثيل الموكلين بنجاح أمام المحاكم القضائية.</li>
    <li><strong>وظائف خالية محامين جدول عام:</strong>هذا النوع من الوظائف القانونية يعد خيارًا أكثر ملاءمةً مع المحامين الذين يتمتعون بانسجام ومرونة قوية في مختلف مجالات القانون. هذه الوظيفة تتطلب من المحامي امتلاك القدرة والموهبة في التعلم السريع والتعامل مع القضايا المعقدة, بما في ذلك القضايا الجنائية وقضايا الأحوال الشخصية بفاعلية ومرونة كبيرة.</li>
    <li><strong>وظائف خالية محامين حديث التخرج:</strong>هذه الوظيفة تمثل فرصة رائعة لتحفيز عمليات التطوير واستخراج الإبداع في تلبية ما تطلبه مهنة المحاماة من واجبات وإجراءات قانونية, يستمدوها من خبراء متمرسين في هذه المهنة, حيث يمثلون مدربين لمَن هم حديثي التخرج لاكتساب المهارات وإتقان عرض الخدمات القانونية بجودة تقديم عالية.</li>
    <li><strong>وظائف خالية محامين نقض:</strong>وأخيرًا وظائف محامين نقض, التي تعد وظيفة من الوظائف القانونية صاحبة الشأن الأكبر في التأثير على مسار العدالة الحق, في مكاتبنا نوفر وظائف خالية محامين نقض خبرة نظرًا لحاجة هذا النوع من وظائف المحاماه إلى امتلاك صاحبها القدرة العالية على الإقناع وتقديم الأدلة والحجج مواجهةً لأكثر القضايا تعقيدًا؛ مما يساعد ذلك على تطوير الطرق القانونية لحل القضايا بالشكل الصحيح وفتح آفاق جديدة للقضايا المستقبلية.</li>,
    </ul>
    `,
  },
  {
    title: "مطلوب محامين خريجين حقوق عربي وإنجليزي",
    desc: `<p>في المجموعة التجارية والبحرية للمحاماة، نوفر وظائف خاليه للمحامين حديثي التخرج من كليات الحقوق العربية والإنجليزية يتمتعون بمعرفة وإدراك عميق حول شتى المجالات القانونية, كما يجب أن يكونوا متعدِّدي اللغات والثقافات؛ فهما عنصران أساسيان في عالم القانون الحديث, بناءً على ذلك فإننا نسعى لتوفير أكبر عدد وظائف محامين للسمو بتطبيق عدالة القانون على أوسع نطاق ممكن.</p>
<ul>
<li><strong>خريجين حقوق عربي: </strong>في حال كنت خريجًا من إحدى كليات الحقوق العربية وتبحث عن أي من وظائف المحاماه؛ فإن لمهارة إتقانك للغة العربية الفصحى وامتلاك قائمة من المصطلحات القانونية الشائعة, بالإضافة إلى إدراكك القوي بالنظام القانوني العربي؛ سيكون له دور بارز وقوي في تقديم كافة الخدمات القانونية لعملائنا من جميع أنحاء مصر والشرق الأوسط, من إعداد وثائق ومستندات قانونية بشكل صحيح وكفاءة عمل عالية لجميع العملاء العرب.</li>

<li><strong>خريجين حقوق إنجليزي: </strong>إذا كنت خريجًا من إحدى كليات الحقوق الإنجليزية وتبحث عن وظيفة من الوظائف القانونية؛ ففي طبيعة الحال ستكون متقنًا للغة الإنجليزية ومطلع على المصطلحات القانونية, وتتمتع بفهم عميق حول النظام القانوني الدولي. تعد اللغة الإنجليزية سبيل التواصل القانوني العالمي ولغة الأعمال الدولية في جميع أنحاء العالم, بناءً على ذلك؛ فإنك سوف تمثل الفائدة الكبرى في التعامل والتواصل بفعالية مع عملائنا في قضايا التجارة الدولية والقانون الدولي.</li>
</ul>
<p>لا نكتفي فقط بتوفير وظائف خالية للمحامين, بل نحرص ايضاً على توفير بيئة تطوير فعّالة وبيئة عمل لتحفيز ممارسة المهنة. في مكاتبنا نحن نهتم بتقدير المعرفة والإدراك العميق لمجالات القانون المختلفة والاطلاع على مواد وبنود القانون المصري المعمول به؛ فنحن نقرّ بسعينا إلى التطور الدائم والسريع وتقديم كافة طرق الخدمات القانونية لعملائنا وموكلينا في الشرق الأوسط؛ لذا إن كنت تبحث على وظائف محامين وترغب في الانضمام إلى فريق عملنا المتخصص, فإننا نتطلع إلى التعرف على مؤهلاتك المقدمة والاستماع إلى رؤيتك في إمكانياتك على المساهمة الفعلية.</p>'
`,
  },
];
const Accordion = () => {
  return (
    <section className="accordionQuestions">
      <h2>نظرة حول وظائف خالية للمحامين في TCMG</h2>
      {data.map((el, index) => (
        <AccordionCard title={el.title} desc={el.desc} key={index} />
      ))}
    </section>
  );
};

export default Accordion;
