import React from "react";
import styles from "./page.module.css";
export default function CookiesManagement() {
  return (
    <section className={styles.cookiesMang}>
      <div className={styles.headerMang}>
        <h3>إدارة الكوكيز</h3>
        <p>
          الكوكيز هي ملفات نصية صغيرة يمكن للمواقع الإلكترونية استخدامها لتحسين
          تجربة المستخدم.القانون ينص على أنه يجوز لنا تخزين الكوكيز على جهازك
          إذا كانت ضرورية للغاية لعمل هذا الموقع. لجميع أنواع الكوكيز الأخرى ،
          نحتاج إلى إذنك. يستخدم هذا الموقع أنواعًا مختلفة من الكوكيز. يتم وضع
          بعض ملفات تعريف الارتباط بواسطة خدمات خارجية تظهر على صفحاتنا.
        </p>
        <button className={styles.acceptAll}>قبول الجميع</button>
      </div>
      <div className={styles.cookiesList}>
        <div className={styles.cookieItemOne}>
          <div className={styles.cookieItemContainer}>
            <div>
              <strong>الكوكيز الأساسية </strong>
              <strong>دائمًا نشط</strong>
            </div>
            <p>
              هذه الكوكيز ضرورية لكي يعمل الموقع الإلكتروني ولا يمكن إيقاف
              تشغيلها. يتم تعيين هذه الكوكيز بشكل افتراضي ولا يمكن تعطيلها.
            </p>
          </div>
        </div>

        <div className={styles.cookieItem}>
          <div className={styles.cookieItemContainer}>
            <div>
              <strong>الكوكيز الوظيفية</strong>

              <span>
                <label className={styles.switch}>
                  <input type="checkbox" />
                  <span className={`${styles.slider} ${styles.round}`}></span>
                </label>
              </span>
            </div>
            <p>
              تمكّننا هذه الكوكيز من توفير وظائف محسّنة وتخصيص المحتوى. على سبيل
              المثال، قد نستخدم هذه الكوكيز لتوفير وعرض مقاطع الفيديو والمحتوى
              المضمّن ولتوفير بعض الميزات الأخرى. يتم إدارة بعض هذه الكوكيز من
              قِبل أطراف ثالثة، بما في ذلك موردو الأطراف الثالثة الذين نستخدم
              خدماتهم على موقعنا الإلكتروني. إذا لم تسمح بهذه الكوكيز، فقد لا
              تكون بعض الميزات على هذا الموقع الإلكتروني متاحة أو تعمل بشكل
              صحيح.
            </p>
          </div>
        </div>

        <div className={styles.cookieItem}>
          <div className={styles.cookieItemContainer}>
            <div>
              <strong>كوكيز التحليلات</strong>
              <span>
                <label className={styles.switch}>
                  <input type="checkbox" />
                  <span className={`${styles.slider} ${styles.round}`}></span>
                </label>
              </span>
            </div>
            <p>
              تجمع هذه الكوكيز معلومات حول كيفية استخدامك لموقعنا الإلكتروني -
              مثل الصفحات التي تزورها وما إذا كنت تواجه أي أخطاء. تتيح لنا عد
              الزيارات ومصادر حركة المرور حتى نتمكن من قياس وتحسين أداء مواقعنا
              الإلكترونية ومحتوياتها. على سبيل المثال، تساعدنا في معرفة الصفحات
              الأكثر والأقل شعبية ورؤية كيفية تنقل الزوار في الموقع الإلكتروني.
              يتم إدارة بعض ملفات تعريف الارتباط الخاصة بالأداء لدينا من قِبل
              أطراف ثالثة.
            </p>
          </div>
        </div>

        <div className={styles.cookieItem}>
          <div className={styles.cookieItemContainer}>
            <div>
              <strong>كوكيز الإعلانات</strong>
              <span>
                <label className={styles.switch}>
                  <input type="checkbox" />
                  <span className={`${styles.slider} ${styles.round}`}></span>
                </label>
              </span>
            </div>
            <p>
              قد تجمع هذه الكوكيز بيانات التصفح والنشاط على مواقعنا الإلكترونية
              وعلى مواقع الجهات الخارجية. نستخدمها لمساعدتنا في تزويدك بمحتوى
              أكثر ملاءمة على موقعنا الإلكتروني وعلى قنوات التسويق الرقمي الخاصة
              بنا. على سبيل المثال، نستخدم Vuture لإرسال رسائل البريد الإلكتروني
              التسويقية الخاصة بنا، والتي قد تتضمن بكسلات تتبع تساعدنا في تقييم
              أداء البريد الإلكتروني. إذا قمت بزيارة موقعنا الإلكتروني أو الوصول
              إلى المحتوى عبر الإنترنت من خلال رابط في أحد رسائل البريد
              الإلكتروني التسويقية الخاصة بنا، فإننا نستخدم الكوكيز على موقعنا
              الإلكتروني لربط رحلتك التسويقية عبر البريد الإلكتروني برحلتك على
              الموقع الإلكتروني. كما تستخدم كوكيز الإعلانات لتمكين وسائل التواصل
              الاجتماعي وميزات الجهات الخارجية على هذا الموقع الإلكتروني. يتم
              تعيين بعض كوكيز الإعلانات من قِبل أطراف ثالثة ويسمح لهم بتتبع
              متصفحك وبيانات نشاطك عبر مواقعنا الإلكترونية ومواقع أخرى، والتي قد
              يستخدمونها لبناء ملف تعريف لاهتماماتك واستهداف الإعلانات والمحتوى
              لك عبر مواقع الجهات الخارجية.
            </p>
          </div>
        </div>
      </div>
      <div className={`${styles.buttons} ${styles.bottomButtons}`}>
        <button>حفظ وإغلاق</button>
        <button>رفض الكل</button>
      </div>
    </section>
  );
}
