import styles from "./page.module.css"
const RelationHero = () => {
  return (
    <section className={styles.hero}>
<div className={styles.head}>
<h1 >
    بناء شراكات استراتيجية: اكتشف فرص التعاون مع مكاتب TCMG للمحاماة لتحقيق النجاح المشترك
    </h1>
    <p>نسعى في TCMG إلى بناء بروتوكول تعاون قوي يفتح آفاقًا جديدة للتعاون المثمر. اكتشف فرص الشراكة معنا لتعزيز خبراتك وتحقيق نجاح مشترك في سوق القانون الدولي.</p>

</div>
    <div className={styles.headmob}>
      <h2>بناء شراكات استراتيجية: اكتشف فرص التعاون مع مكاتب TCMG للمحاماة لتحقيق النجاح المشترك</h2>
    <p>نسعى في TCMG إلى بناء بروتوكول تعاون قوي يفتح آفاقًا جديدة للتعاون المثمر. اكتشف فرص الشراكة معنا لتعزيز خبراتك وتحقيق نجاح مشترك في سوق القانون الدولي.</p>
    </div>
  </section>
  )
}

export default RelationHero
