import styles from "./page.module.css"
const InternHero = () => {
  return (
    <section className={styles.hero}>
        <h1>
   <br/> انطلق نحو مستقبل واعد في مجال المحاماة 
   مع برنامج تدريب محاماة متكامل في TCMG
   </h1>
   <p>تؤمن مجموعة TCMG بأن الطريق إلى النجاح في مجال القانون يبدأ بالتدريب المتكامل والاحترافي. ولذلك نقدم فرصة استثنائية لتطوير المهارات القانونية من خلال برنامج تدريب محامين حديثي التخرج، الذي يجمع بين التعلم النظري والتطبيق العملي في بيئة مهنية ملهمة. </p>
      </section>
  )
}

export default InternHero
