import styles from './page.module.css'
const JoinHero = () => {
  return (
    <section className={styles.hero}>
        <h1>
        إنضم إلى مكاتب TCMG للمحاماة وشاركنا رحلة النجاح القانوني
        </h1>
        <p>مرحبًا بك في صفحة انضم إلينا، حيث نسعى إلى جذب المحامين المتميزين والمبدعين للانضمام إلى فريقنا القانوني. اكتشف فرص النمو والتطور المهني في بيئة تحفز على الابتكار والتعاون. بالإضافة لبدء علاقات استراتيجة مع شركات ومكاتب محاماة للتوسع الدولي في الحلول القانونية بالشرق الأوسط.</p>
      </section>
  )
}

export default JoinHero
