import React, { useState } from 'react';
import styles from './page.module.css';
import Image from 'next/image';

export default function ModalPrivacy({showModal , setShowModal}) {

    const handleClose = () => {
        setShowModal(false);
    };

    return (
        <>
            {open && (
                <div className={styles.modalPrivacy}>
                        {/* Close button */}
                        <div onClick={handleClose} className={styles.closeButton}>
                            <Image src="/assets/icons/form/close.png" alt="Close Icon" width={31} height={31} />
                        </div>

                        <h2>معلومات الخصوصية</h2>
                        <p>سياسة شروط وأحكام حجز استشارات قانونية</p>

                        <ol>
                            <li>
                                الحجز والدفع: يجب على العميل إجراء حجز للاستشارة القانونية المطلوبة وتأكيدها عن طريق تقديم تفاصيل البطاقة الائتمانية الصحيحة.
                                سيتم احتساب رسوم الحجز من البطاقة الائتمانية في الوقت الفعلي.
                            </li>
                            <li>
                                سرية المعلومات: ستتم معالجة المعلومات الشخصية والمالية الخاصة بالعميل بسرية تامة. لن يتم مشاركة هذه المعلومات مع أي جهة خارجية وفقًا للوائح القانونية السارية.
                            </li>
                            <li>
                                إلغاء الحجز: في حالة رغبة العميل في إلغاء الحجز، يجب إبلاغنا بذلك قبل الموعد المحدد للاستشارة ب 12 ساعة. قد يتم تطبيق رسوم إلغاء ٥٠ جنيه مصري.
                            </li>
                            <li>
                                تعديل الموعد: يمكن للعميل طلب تعديل الموعد المحدد للاستشارة بإبلاغنا عن طريق البريد الإلكتروني book@tcmglaw.com او رقم الهاتف 01276299998 بذلك قبل الموعد ب 12 ساعة. يتوقف قبول التعديل على توافر المستشار القانوني المطلوب.
                            </li>
                            <li>
                                رفض الخدمة: قد يتم رفض الخدمة في حالة عدم توفر مستشار قانوني مؤهل لتقديم الاستشارة المطلوبة في الموعد المحدد. سيتم إعلام العميل بذلك وسيتم استرداد أي رسوم دفعت مقدمًا.
                            </li>
                            <li>
                                مراجعة العقود أو المستندات تكون بتكلفة إضافية وتحدد إتعاب المراجعة أو الصياغة بناء على العقد أو المستند.
                            </li>
                            <li>
                                التعويضات: في حالة وجود أي مشاكل أو خلافات فيما يتعلق بالاستشارة القانونية، لن يكون للعميل الحق في المطالبة بأي تعويض مالي. تقتصر مسؤوليتنا على استرداد أي رسوم دفعت مقدمًا في حالة عدم توفر الخدمة.
                            </li>
                            <li>
                                الامتناع عن المسؤولية: يتم تقديم الاستشارة القانونية كما هي، ولا يمكن اعتبارها بديلاً للمشورة القانونية الشخصية. لا يتحمل المزود أي مسؤولية عن أي خسائر أو أضرار تنتج عن استخدام أو اعتماد العميل للمشورة القانونية المقدمة.
                            </li>
                            <li>
                                قوانين ونزاعات القانون: تخضع هذه السياسة للقوانين السارية في مصر وفي حالة وجود أي نزاعات تنشأ عن هذه السياسة، يجب أن يتم حلها بطرق قانونية وفقًا للقوانين ذات الصلة وتختص محكمة شمال القاهرة بالفصل في سياسة الخطة.
                            </li>
                        </ol>
                </div>
            )}
        </>
    );
}
