import styles from "./page.module.css"
const TcmgPartnership = () => {
  return (
    <section className={styles.tcmgPartnership}>
        <div>
          <h2>حقق التميز والنجاح من خلال الشراكة مع مكاتب TCMG للمحاماة</h2>
          <p>
          نسعى لبناء بروتوكول تعاون قائم على الثقة والإحترافية مع مكاتب المحاماة الأخرى, من خلال خبرتنا الواسعة والمتنوعة في مجال القانون؛ نضمن لكم تقديم خدمات متميزة وحلول قانونية مبتكرة تلبي تطلعات جميع عملائنا وتحقق أهدافهم. انضموا إلينا اليوم واستفيدوا من شراكة قوية تسهم في نجاحكم المستقبلي في عالم القانون. يمكنكم الانضمام إلى شبكتنا القانونية الواسعة من خلال ملئ الفورم التالي أو التواصل معنا عن طريق إحدى الوسائل القادمة: 
          </p>
          <a href="mailto:Pr@tcmglaw.com">Pr@tcmglaw.com</a>
        </div>
      </section>
  )
}

export default TcmgPartnership
