"use client";

import AccordionCard from "@/components/shared/client/accordionCard/AccordionCard";


const data = [
  {
    title: "ما هي برامج التدريب المتاحة في TCMG للمحامين الجدد؟",
    desc: `
    <p>تقوم مكاتب TCMG للمحامين بتقديم تدريب محاماه مميز يتضمن العديد من الفرص المتنوعة التي تهدف إلى تطوير مهاراتهم وتحقيق نجاح مهني مستدام. لا نقدم برنامج تدريب محامين حديثي التخرج فقط بل نقدم العديد من برامج تدريب المحامين, منها:</p>

<p><strong>برنامج التدريب الشامل:</strong> نقدم برنامج تدريب محامين شامل, يمنح الفرصة للمحامين الجدد لاكتساب معرفة واسعة في مجالات مختلفة من القانون, بما في ذلك القانون التجاري, القانون الجنائي, القانون الدولي وغيرها الكثير من مجالات القانون الأخرى.</p>

<p><strong>التوجيه الفردي:</strong> يعمل برنامج تدريب محامين حديثي التخرج هذا على اتاحة الفرصة للمحامين الجدد العمل مع محامين خبراء في مجالات محددة؛ مما يسمح لهم بالاستفادة من الإرشاد والنصائح القيمة وتطوير مهاراتهم القانونية.</p>

<p><strong>الدورات التدريبية المتخصصة:</strong> تهدف إلى تطوير مهارات محددة في المحاماة، فتدريب المحاماه هذا يساعد على نمو مهاراتك المهنية مثل مهارات التفاوض والبحث القانوني، والتحليل القانوني، والتمثيل القانوني، وغيرها، من خلال دورات تدريبية متخصصة ومنهجية.</p>
<p><strong>الفرص العملية:</strong> يمكن للمحامين الجدد المشاركة في أعمال عملية حقيقية تحت إشراف محامين متمرسين، حيث نقدم تدريب محاماه مميز يساعد في تدريب المحامين بشكل كافي لتطبيق المفاهيم النظرية في الواقع العملي وبناء خبرة قيمة في الميدان.</p>

<p>برامج تدريب المحامين هذه الخاصة بنا, توفر تجربة تدريبية شاملة ومتكاملة تساعد المحامين الجدد على تطوير مهاراتهم والاستعداد لمسيرة مهنية ناجحة في مجال المحاماة.</p>

    `,
  },
  {
    title:"كيف يمكنني التقديم لبرنامج التدريب في TCMG؟",
    desc: `
<p>إذا كنت تبحث عن مكتب محاماة للتدريب وتطمح إلى بناء مستقبل مهني مشرق في مجال المحاماة, توفر مكاتب TCMG للمحاماة برنامج تدريب محامين حديثي التخرج والذي يمكنّك من اكتساب المهارات القانونية اللازمة وتحقيق النجاح في مسيرتك المهنية. إليك الخطوات اللازمة للتقديم في برنامج تدريب المحامين الخاص ب TCMG:</p>

<ol>
  <li>قم بزيارة موقعنا الإلكتروني وانتقل إلى صفحة "التدريب".</li>
  <li>ستجد استمارة تدريب المحامين الخاص بنا، قم بملئها بالمعلومات المطلوبة، بما في ذلك تفاصيلك الشخصية والمهنية وتجربتك السابقة.</li>
  <li>تأكد من مراجعة المعلومات بعناية وتحقق من أن كل الحقول قد تم ملؤها بشكل صحيح.</li>
  <li>اضغط على زر "إرسال" لتقديم طلبك للانضمام لبرنامج تدريب المحامين.</li>
  <li>بعد ذلك، ستتلقى تأكيدًا عبر البريد الإلكتروني من فريقنا في TCMG بشأن استلام طلبك وترتيب المقابلة القادمة.</li>
</ol>
<p>احرص على حضور المقابلة المحددة, وكن جاهزًا للمناقشة حول خبراتك وأهدافك المهنية. وبعد اجتياز المقابلة بنجاح؛ ستتلقى تأكيدًا نهائيًا بالقبول في برنامج تدريب محامين حديثي التخرج, وستبدأ رحلتك المهنية الجديدة معنا في TCMG. لا تفوت الفرصة.</p>
    `
  },
  {
    title: "ما هي المجالات القانونية التي يغطيها برنامج التدريب في TCMG؟",
    desc: `مكاتب TCMG للمحاماة تقدم برنامج تدريب محامين يشمل مجموعة واسعة من المجالات القانونية المتخصصة؛ مما يتيح للمتدربين الجدد اكتساب خبرة شاملة وتنوع في مختلف جوانب القانون. بعض المجالات التي يغطيها تدريب محامين حديثي التخرج الخاص بنا, على سبيل المثال لا الحصر، القانون التجاري، والقانون الجنائي، والقانون الدولي، وقانون الملكية الفكرية، والقانون العقاري، وغيرها كثير من مجالات القانون الاخرى. التدريب في مكتب محاماة متخصص يغطي عدد كبير من المجالات؛ يمكن المتدربين الجدد من اكتساب مهارات متعددة وتجارب قيمة تساهم في بناء أسس قوية لمسيرتهم المهنية في مجال المحاماة. إذا ما تزال تبحث عن مكتب محاماة للتدريب فبامكانك التوقف الآن والانضمام الينا لبناء مستقبل مهني مميز.`,
  },
  {
    title: "هل يتضمن برنامج التدريب في TCMG فرص عمل عملية؟",
    desc: `يسعدني اخبارك ان برنامج تدريب المحامين الخاص بنا, يتضمن فرصًا عملية تهدف إلى توفير تجارب غنية وقيمة للمتدربين. حيث يتمكن المشاركون في تدريب المحاماه الخاص بنا من المشاركة في أعمال مهنية حقيقية تحت إشراف محامين مخضرمين؛ فنحن نسعى الى توفير فهماً عميقاً للتحديات والمتطلبات العملية لمجال المحاماة من خلال تدريب المحامين حديثي التخرج خاصتنا. تتيح هذه الفرص للمتدربين تطبيق المفاهيم النظرية في سياقات العمل الحقيقية، وتعزز من تطوير مهاراتهم القانونية والعملية بشكل فعّال.
 ختاماً, يحصل المتدربون على خبرة قيمة وثقة في قدراتهم خلال التدريب في مكتب محاماة متخصص؛ مما يعزز من فرص نجاحهم في مسيرتهم المهنية في مجال المحاماة. لذا إذا كنت تبحث عن مكتب محاماة للتدريب ف كفاك بحثاً وانضم الى تدريب محامين خصتنا لتكتسب خبرة مهنية لا مثيل لها.
`,
  },
  {
    title: "ما هي المهارات والخبرات المطلوبة للالتحاق ببرنامج التدريب في TCMG؟",
    desc : `
    <p>برنامج تدريب المحامين في TCMG, يتطلب مجموعة من المهارات والخبرات التي تسهم في تعزيز تجربة تدريب المحاماة والاستفادة منها بشكل كامل. إليك الآن المهارات والخبرات المطلوبة للالتحاق بالبرنامج بنجاح:</p>
   <ul>
    <li><strong>المعرفة الأساسية بالقانون:</strong> يُفضَّل أن يكون لدى المتقدمين فهماً جيداً للمصطلحات القانونية الأساسية.</li>
    <li><strong>مهارات البحث والتحليل:</strong> يتطلب للمشاركة في برنامج تدريب المحاماة القدرة على البحث بشكل فعّال وتحليل المعلومات القانونية بدقة وفهمها.</li>
    <li><strong>مهارات الاتصال:</strong> يتطلب تدريب المحامين القدرة على التواصل الفعّال والتفاعل مع الفريق والعملاء بشكل لبق ومؤثر.</li>
    <li><strong>المرونة والقدرة على التكيف:</strong> القدرة على التكيف مع بيئة العمل المتغيرة والتعامل مع التحديات بروح من المرونة والحلول الإبداعية.</li>
    <li><strong>المسؤولية والتفاني:</strong> نقوم بتوفير برنامج تدريب محامين حديثي التخرج، ولكن يشترط الالتزام بالمسؤوليات الملقاة على عاتقهم والعمل بجدية وتفانٍ لتحقيق الأهداف المحددة.</li>
    <li><strong>الرغبة في التعلم:</strong> من أهم شروط القبول في تدريب المحاماة، الرغبة في الاستمرار في التعلم وتطوير الذات في مجال القانون.</li>
</ul>
<p>تلتزم TCMG بتوفير التدريب في مكتب محاماة متخصص, وأيضاً توفر بيئة داعمة لتطوير هذه المهارات والخبرات لدى المتدربين الطموحين والمبادرين؛ لذا بادر في الالتحاق بتدريب محامين حديثي التخرج الخاص بنا إذا كانت تتوافر لديك هذه المهارات.</p>

    `
  },
  {
    title : "هل هناك أي تكاليف مرتبطة ببرنامج التدريب في TCMG؟",
    desc : `التدريب في مكتب محاماة مثلنا يمثل فرصة قيَّمة يقدمها المكتب للمهتمين بالمجال القانوني لتطوير مهاراتهم واكتساب خبرات عملية يمكن استغلالها في أرض الواقع. 
ما يميز برنامج تدريب محامين حديثي التخرج في TCMG أنه مجاني تمامًا؛ لذا حيث لا تترتب على المشاركين أية تكاليف مالية. 
`
  }
];

const Accordion = () => {
  return (
    <section className="accordionQuestions">
      <h2>نظرة حول تدريب المحاماه الخاص ب TCMG</h2>
      {
        data.map((el, index) => (
          <AccordionCard title={el.title} desc={el.desc} key={index} />
        ))
      }
    </section>
  );
};

export default Accordion;
