import styles from "./page.module.css"
const InternAspirations = () => {
  return (
    <section className={styles.aspirations}>
    <h2>ما نطمح إليه من فريق المتدربين الخاص بنا</h2>
    <div>
      <p>إذا كنت تبحث مكتب محاماة يقدم فرصة تدريب محامين حديثي التخرج؛ فنحن نتطلع إلى مشاركتك في رحلتنا وتحقيق النجاح والنمو معًا. نتطلع إلى انضمام أشخاص ملهمون وملتزمون بالتعلم والنمو المهني. نبحث عن مَن يريدون تدريب محاماة, من الشروط المطلوبة من المتدربين:</p>
      <ul>
        <li>شغفًا وحماسًا عاليًا للعمل
        </li>
        <li>التواصل الفعّال والعمل الجماعي
        </li>
        <li>المرونة والقدرة على التكيف
        </li>
        <li>السعي المستمر لتحقيق الأفضل
        </li>
      </ul>
    </div>
    {/* <p>نتطلع إلى انضمام أشخاص ملهمون وملتزمون بالتعلم والنمو المهني. نبحث عن من يريدون تدريب محاماة ولكن يُشتَرط أن يكونوا ممن يمتلكون شغفًا وحماسًا للعمل في مجال القانون، والذين يتمتعون بقدرة على التواصل الفعّال والعمل الجماعي. نحن نرغب في وجود أشخاص يتمتعون بالمرونة والقدرة على التكيف مع تغييرات البيئة المهنية ويسعون دائمًا لتحقيق أفضل النتائج والتميز في عملهم. إذا كنت تبحث مكتب محاماة يقدم خدمة تدريب محامين حديثي التخرج ويقدم فرص للتطور, فنحن نتطلع إلى مشاركتك في رحلتنا وتحقيق النجاح والنمو معًا.</p> */}
  </section>
  )
}

export default InternAspirations
