import Image from "next/image";
import styles from "./page.module.css";
import LegalServiceCard from "./LegalServiceCard";
const data = [
  {
    title: "استشارة هاتفية",
    desc: "اطلب الآن استشاره قانونيه هاتفية؛ فهي الحل الأمثل والأسرع في حالة كان لديك مشاكل قانونية وترغب في الحصول على حلول فورية أو لديك عائق من الذهاب لزيارة أحد مكاتبنا شخصيًا. نرحب بكم في TCMG باتصالاتكم للإجابة على جميع استفساراتكم. اطلب رقم محامي؛ وسيتواصل معك أحد خبرائنا ليشاركك بالمعرفة والخبرة القانونية التي تحتاجها واللازمة لقضيتك.",
    path: "/assets/icons/legalconsultations/استشارة هاتفية-1.svg",
    alt : "استشارة هاتفية"
  },
  {
    title: "إجتماع أونلاين",
    desc: `أتاح تطبيق الواتس أب سهولة التواصل بين الأفراد، و بأخص الحديث عن 
      المستشارين القانونيين في توفير امكانية التواصل مع الموكلين وطلب استشارات 
      قانونية واتس أب. والذي يتيح التواصل عبر الرسائل النصية أو الصوتية وأيضا 
      المجموعات الاستشارية، مع الحفاظ على سرية الاستشارة من رسائل العميل إلى 
      تفاصيل قضيته المُستشار فيها. كل ما عليك هو مراسلة المجموعة التجارية 
      والبحرية للمحاماة عبر حساب الواتس اب الرسمي لها، ثم توضيح موضوع استشارتك 
      ليقوم بالرد عليك مستشار قانوني متخصص مستعد لدعمك.`,
          path: "/assets/icons/legalconsultations/أونلاين.svg",
    alt : "إجتماع أونلاين"
  },
  

  {
    title: "استشارة مكتبية",
    desc: "تعد أفضل الطرق للحصول على استشارة محامي هي بحجز زيارة في أحد مكاتب TCMG الاستشارية، حيث أن طرح التساؤلات في قضية ما وجهًا لوجه بين المستشار والموكل يعد طريقة فعالة تتضمن الفهم العميق لجميع نواحي المسائل والإجراءات اللازمة لتجنب مخالفة القانون. كل ما عليك فعله هو حجز موعد مع أحد خبرائنا، وسنكون بانتظارك لإمدادك بكافة السبل الممكنة للنصر في قضيتك وتحقيق هدفك القانوني.",
    path: "/assets/icons/legalconsultations/استشارة مكتبية (1).svg",
    alt : "استشارة مكتبية"
  },
  {
    title: "استشارة شركات",
    desc: "احصل على استشارات قانونية فورية في قانون الأعمال، حيث أنه باستشارة محامي شركات يساعدك على تجنب المخاطر القانونية واتخاذ القرارات السليمة وتعزيز مكانة شركتك في السوق. تخضع الشركات لعدد كبير من القوانين واللوائح التي تتغير باستمرار، ولذلك فإن استشارة أعمال الشركات والشؤون القانونية تضعك على المسار الصحيح. حيث يمكن للمستشار القانوني مساعدة شركتك على فهم هذه القوانين والامتثال لها؛ مما يجنِّبُك التعرض للغرامات والعقوبات القانونية.",
    path: "/assets/icons/legalconsultations/sاستشارة شركات.svg",
    alt : "استشارة شركات"
  },

 

];
const EstablishLegalServices = () => {
  return (
    <section className={styles.whyChoose}>
      <div className={styles.whyChooseContent}>
      <div className={styles.header}>
      <Image src="/assets/icons/crown.svg" width={60} height={25} alt='Crown Icon' />

<h2>خدماتنا القانونية في تأسيس الشركات</h2>
      </div>
    
        <p>
        عملنا بجد لتقديم خدمات ذكية ومرنة ومعقولة التكلفة تعود بالنفع على جميع عملائنا الراغبين في تأسيس الشركات في مصر والوطن العربي. تصفح قائمة خدماتنا ، واتصل بنا لحجز لقاء تمهيدي مع أحد خبراء مكاتب  TCMG.
        </p>
      </div>
      <div className={styles.accordionParent}>
        <LegalServiceCard
          title={data[0].title}
          path={data[0].path}
          desc={data[0].desc}
          alt = {data[0].alt}
        />
        <LegalServiceCard
          title={data[1].title}
          path={data[1].path}
          desc={data[1].desc}
          alt = {data[1].alt}

        />
        <LegalServiceCard
          title={data[2].title}
          path={data[2].path}
          desc={data[2].desc}
          alt = {data[2].alt}

        />
        <LegalServiceCard
          title={data[3].title}
          path={data[3].path}
          desc={data[3].desc}
          alt = {data[3].alt}

        />
     
     
      </div>
    </section>
  );
};

export default EstablishLegalServices;
