import styles from "./page.module.css"
export default function HireHero() {
  return (
    <section className={styles.hero}>
        <div className={styles.content}>
          <h1>
          توكيل محامي يناضل من أجل تحقيق أهدافك القانونية
          </h1>
          <p>
          هل ترغب في توكيل محامي يساعدك في حل مشاكلك القانونية؟ هل لديك أهداف قانونية ترغب في تحقيقها في أسرع وقت وبأعلى قدر من الكفاءة؟ إذاً فإن خيارك الأمثل هو الاستعانة بمكاتب TCMG للمحاماة وعمل توكيل لأحد خبرائنا؛ حتى نتمكن من تولي شؤونك القانونية عنك، بمساعدة نخبة من خبراء القانون بخبرة مهنية تخطت ال30 عاماً؛ لإيجاد حلول بمعايير عالمية، تماشيًا مع معطيات قضيتك، للفوز بها واسترجاع حقوقك المسلوبة.
          </p>
        </div>
      </section>
  )
}
