import styles from './page.module.css';

export default function PrivacyStatement() {
    return (
        <section className={styles.privacyStatement}>
            <div>
                <h2>المجموعة التجارية والبحرية</h2>
                <p>
                    (&quot;أو &quot;نحن&quot; أو &quot;لنا&quot; أو &quot;خاصتنا&quot; &quot;TCMG&quot;المشار إليها بأسم)
                    تحترم خصوصياتك ولذا حرصا علي حقوقك وسلامتك الأمنية يجب عليك قراءة البنود كاملة مع مراعاة أي إضافات قد تطرأ في المستقبل والموافقة عليها حتى يستثني لك استخدام خدماتنا.
                </p>
                <p>
                    توضح هذه السياسة كيفية معاملة معلوماتك الشخصية عند استخدامك لموقع وخدمات المجموعة التجارية والبحرية (الإلكترونية) لا تنطبق هذه السياسة على العلاقات بين المحامي والعميل التي تحميها السرية أو امتياز المحامي أو العميل أو مبدأ منتج عمل المحامي، للحد من الحماية الناتجة عن هذه العلاقات.
                </p>
            </div>
        </section>
    );
}
