"use client";
import styles from "./page.module.css"
import WhyChooseAccordion from "./WhyChooseAccordion";
const data = [
  {
    title: "فرص التطوير المهني",
    desc : "في TCMG، لا نكتفي فقط بتقديم وظائف للمحامين بل ايضاً نولي اهتمامًا كبيرًا لتطوير مهارات محامينا وتوفير فرص تطوير مهني مستمرة. برنامجنا التدريبي يمكنك من استكشاف مجالات جديدة في القانون وتعزيز مهاراتك القانونية. كما نقدم فرص التقدم في الشركة والحصول على مسؤوليات أكبر؛ مما يساهم في نموك المهني وتحقيق أهدافك الشخصية في مجال المحاماة."
  },
  {
    title : "بيئة عمل محفزة",
    desc : "مكتب TCMG للمحاماة, على عكس معظم الوظائف القانونية فنحن نقدم بيئة ملهمة للمحامين حيث يتم تشجيعهم على التفوق والابتكار. نحن نقدر ونشجع التعاون وتبادل الأفكار؛ مما يساعد في بناء روح الفريق القوية وتحقيق أهدافنا المشتركة. توفر هذه البيئة العملية الدعم اللازم للموظفين الجدد لتطوير مهاراتهم وتحقيق نجاحهم المهني."
  },
  {
    title : "فرص دولية",
    desc : "في مكتبانا, نحن نوفر وظائف خاليه للمحامين بالاضافة لذلك نوفر لهم فرصاً مميزة للعمل على قضايا دولية متنوعة؛ مما يمنحهم تجربة تدريبية ومهنية قيمة. يمكن للمحامين الاستفادة من هذه الفرص لتوسيع خبرتهم المهنية وبناء شبكات علاقات دولية قوية. بالإضافة إلى ذلك, تسهم هذه الفرص في تطوير مهاراتهم في مجال القانون الدولي وتوفير وظائف خالية للمحامين بالشركات الدولية لهم."
  },
  {
    title : "ثقافة العمل الاحترافية",
    desc : "في TCMG تمثل ثقافة العمل الاحترافية أساس عملنا؛ فنحن لا نوفر وظائف المحاماه فقط, بل نعتمد على الاحترام المتبادل والتعاون الفعَّال بين أفراد الفريق. نحن نشجع على التواصل الصريح والشفافية في التعاملات؛ مما يساهم في بناء ثقة قوية بيننا وبين عملائنا. على عكس كثير من الوظائف القانونية, فنحن نلتزم بمعايير الجودة العالية في أداء عملنا ونسعى جاهدين لتحقيق الرضا الكامل لعملائنا من خلال العمل بنزاهة ومسؤولية."
  }
];
const HiringWhyChooseUs = () => {
  return (
    <section className={styles.whyChoose}>
      <div className={styles.whyChooseContent}>
       <h2>مميزات العمل معنا</h2>
        <p>
        كفاك بحثاً الآن عن وظائف خالية للمحامين؛ فـ TCMG للمحاماة يقدم مجموعة من الوظائف القانونية المميزة. بالاضافة لذلك انه سيقدم لك بيئة عمل ملهمة, تتيح لك الفرصة لتطوير مهاراتك وتحقيق إمكانياتك الكاملة كمحامٍ. من المميزات التي ستجدها من خلال العمل معنا
        </p>
      </div>
      <div className={styles.accordionParent}>
        <WhyChooseAccordion
          title={data[0].title}
          desc={data[0].desc}
          path={data[0].path}
        />
        <WhyChooseAccordion
          title={data[1].title}
          desc={data[1].desc}
          path={data[1].path}
        />
        <WhyChooseAccordion
          title={data[2].title}
          desc={data[2].desc}
          path={data[2].path}
        />
        <WhyChooseAccordion
          title={data[3].title}
          desc={data[3].desc}
          path={data[3].path}
        />
      </div>
    </section>
  );
};

export default HiringWhyChooseUs;
