"use client";

import AccordionCard from "@/components/shared/client/accordionCard/AccordionCard";

const data = [
  {
    title:
      "ما الخدمات القانونية التي تقدمها المجموعة التجارية والبحرية للشركات؟",
    desc: `
          تُعد المجموعة التجارية والبحرية للمحاماة شريكًا استراتيجيًا للشركات, حيث نقدم مجموعة شاملة من الخدمات القانونية المصممة لتلبية احتياجات الشركات على اختلاف أنواعها وأحجامها. بفضل خبرتنا الواسعة وفريقنا المتخصص, نقدم دعمًا قانونيًا يساهم في تحقيق أهداف الشركات بكل أمان. إليك الآن 4 خدمات قانونية من بين خدماتنا:
          تأسيس الشركات: نحن في TCMG نقدم خدمات تأسيس الشركات بمستوى عالمي، بدءًا من اختيار نوع الشركة المناسب من بين ( فردية- ذات مسؤولية محدودة- مساهمة), إعداد عقود التأسيس واللوائح الداخلية وأيضًا تقديم الدعم القانوني في جميع مراحل التأسيس. نسعى لضمان تأسيس شركة قوية ومتينة تلبي كافة المتطلبات القانونية وتحقق أهدافك التجارية بكفاءة وفاعلية.
          الاندماج والاستحواذ: نقدم خدمات قانونية متنوعة للشركات ومن بينهم الاندماج والاستحواذ, نحن نمتلك خبرة واسعة في هذا المجال, لذا سنعمل على تقديم المشورة القانونية في كل مرحلة من مراحل العملية: بدءًا من التخطيط الاستراتيجي وإجراء الفحص النافي للجهالة إلى إعداد العقود والتفاوض عليها وحتى إتمام الصفقة بنجاح.
          التطوير العقاري والإنشاءات: نقدم مجموعة شاملة من الخدمات القانونية التي تغطي جميع جوانب هذا المجال. نساعد الشركات في إعداد العقود, إدارة المخاطر وحل النزاعات المتعلقة بالمشاريع العقارية والإنشائية. نسعى لضمان نجاح جميع المشاريع من خلال تقديم استشارة قانونية مخصصة ودعم فعّال طوال مدة تواجد المشروع؛ مما يضمن الامتثال الكامل للقوانين واللوائح المحلية والدولية.
          باختيار للمجموعة التجارية والبحرية للمحاماة, ستضمن لشركتك تلقي أفضل خدمات قانونية متخصصة ودعم مستمر؛ مما يجعلك تحقق أهدافك بفعالية وكفاءة. نحن نلتزم بتقديم أعلى مستويات الاحترافية والنزاهة في الخدمات القانونية لضمان نجاحك في السوق المحلي وأيضًا الدولي.
        `,
  },
  {
    title: "ما سعر الخدمات القانونية التي تقدمها المجموعة التجارية والبحرية؟",
    desc: `
          ليس هناك سعر ثابت للخدمات القانونية التي تقدمها المجموعة التجارية والبحرية للمحاماة والاستشارات القانونية، ولكن هناك عدة معايير بناءاً عليها يتم تسعير الخدمات القانونية، منها:
          توقيت طلب الخدمة: يجب مراعاة التوقيت الذي يتم أثنائه طلب الخدمة سواء كانت خدمة استشارة قانونية أو توكيل محامي، في كلتا الحالتين وكلما زاد الوقت الذي استمر خلاله تقديم الخدمة زاد السعر.
          مستوى تعقيد القضية: حيث كلما زاد تعقيد القضية أو موضوع الاستشارة زاد معه تسعير الخدمة لأن معنى كون القضية معقدة أنها تحتاج إلى إجراءات خاصة والتنقل في أماكن متعددة للبحث عن أدلة وشهود تدعم موقف الموكل القانوني.
          الخبرة القانونية: إن كان المحامي الذي تتقدم على توكيله يملك قضايا ناجحة سابقة وماضٍ حافل بالإنجازات فهو مؤشر جيد على سمعة المحامي وخبرته الواسعة حيث قد تم الاستعانة به في العديد من القضايا لموكلين مختلفين.
          استراتيجية التسعير الاختياري: تعد إحدى الطرق التي تجذب العملاء حيث يتم فيها عرض المحامي لخدمة قانونية بسعر منخفض، ثم وعلى مستوى تعقيد القضية أو الوقت الذي استمرت خلاله يتم تحديد تسعير على أساس الخدمات التي قام بها المحامي لحل القضية بنجاح.
          كفاءة المحامي والمستشار: يقوم العديد خاصة في القضايا الشائكة باختيار محامين ذوي كفاءات وخبرات عالية ليضمن نصرته في القضية ولتلك الخبرة والكفاءة يتوجب على العميل الدفع مقابلها؛ فكما يدفع المستهلك لشهرة العلامة التجارية، يجب أن يدفع العميل لشهرة وخبرة المحامي أو المستشار.
        `,
  },
];


function Accordion(){
  return (
  
    <section className="accordionQuestions">
      <h2>الأسئلة الشائعة حول الخدمات القانونية</h2>
      {data.map((el,index) => (
        <AccordionCard title={el.title} desc={el.desc} key={index} />
      ))}
    </section>
  
  );
};

export default Accordion;
